{
  "home": {
    "label": "Una creciente suite de herramientas rápidas y confiables",
    "subLabel": "Construido para la simplicidad y el rendimiento. Se agregan nuevas herramientas regularmente para ayudar a los usuarios a mantenerse productivos y hacer las cosas, sin distracciones ni desorden",
    "title": "Herramientas en línea gratuitas",
    "description": "Descubre herramientas online rápidas y gratuitas para tareas diarias. Rivine Tools ofrece utilidades web centradas en la privacidad.",
    "exploreTools": "Explorar herramientas",
    "keywords": {
      "0": "Herramientas en línea",
      "1": "Herramientas web",
      "2": "Editor de imágenes",
      "3": "Editor de texto",
      "4": "Herramientas de Instagram",
      "5": "Herramientas de Facebook",
      "6": "Colección de herramientas"
    },
    "docs": {
      "valueSection": {
        "title": "🛠️ Herramientas Poderosas para Tareas Diarias",
        "description": "Nuestra colección de herramientas en línea gratuitas te ayuda a resolver desafíos digitales cotidianos sin instalar software adicional. Simples, efectivas y listas cuando las necesitas."
      },
      "benefitsSection": {
        "title": "¿Por Qué Usar Nuestras Herramientas?",
        "benefits": [
          {
            "title": "No Requiere Instalación",
            "description": "Todas las herramientas funcionan directamente en tu navegador - sin descargas, sin instalaciones, sin complicaciones."
          },
          {
            "title": "Enfocadas en la Privacidad",
            "description": "Tus datos permanecen en tu dispositivo. No almacenamos tus archivos o información en nuestros servidores."
          },
          {
            "title": "Gratis para Usar",
            "description": "Todas las herramientas son completamente gratuitas sin costos ocultos ni características premium."
          },
          {
            "title": "Mejoradas Continuamente",
            "description": "Actualizamos regularmente nuestras herramientas basándonos en comentarios de usuarios y avances tecnológicos."
          }
        ]
      },
      "categoriesSection": {
        "title": "Herramientas para Cada Necesidad",
        "categories": [
          {
            "title": "Herramientas de Texto y Documentos",
            "description": "Compara textos, convierte formatos y transforma contenido escrito con facilidad."
          },
          {
            "title": "Utilidades de Imagen",
            "description": "Edita, convierte y combina imágenes sin software complejo."
          },
          {
            "title": "Herramientas de Datos y Conversión",
            "description": "Transforma formatos de datos, convierte unidades y simplifica tareas técnicas."
          },
          {
            "title": "Asistentes Creativos",
            "description": "Genera contenido creativo y visualiza ideas con herramientas intuitivas."
          }
        ]
      },
      "usageSection": {
        "title": "Cómo Empezar",
        "steps": "Simplemente navega por nuestra colección arriba, selecciona la herramienta que necesitas y sigue las instrucciones fáciles en la página de cada herramienta. No se requiere crear una cuenta - solo abre y usa inmediatamente."
      },
      "empowerSection": {
        "title": "Empodera Tu Flujo de Trabajo",
        "steps": "Las herramientas en línea simplifican tareas complejas, permitiéndote ser productivo dondequiera que estés. Ya seas estudiante, desarrollador, diseñador o solo necesites una solución rápida, todo lo que necesitas está a un clic de distancia."
      }
    }
  },
  "general": {
    "download": "Descargar",
    "about": "Acerca de",
    "home": "Página Principal",
    "cancel": "Cancelar",
    "save": "Guardar",
    "upload": "Subir",
    "clear": "Limpiar"
  },
  "tools": {
    "qrCodeGenerator": {
      "title": "Generador de Códigos QR Gratis",
      "label": "Generador de Códigos QR",
      "navDescription": "Crea códigos QR para URLs, texto, números de teléfono y más.",
      "subLabel": "Suite de Generador de Herramientas QR",
      "subNavDescription": "Genera todo tipo de códigos QR en un solo lugar.",
      "description": "Genere códigos QR al instante con nuestro generador de códigos QR en línea gratuito. Personalice con colores, logotipos y descargas de alta calidad.",
      "keywords": {
        "0": "Generador de Códigos QR",
        "1": "Creador de Códigos QR Gratis",
        "2": "Código QR Personalizado",
        "3": "Crear Código QR",
        "4": "Generar Código QR",
        "5": "Código QR de Texto",
        "6": "Generar Código QR en Línea"
      },
      "autoGenerationMessage": "Su Código QR se generará automáticamente",
      "url": {
        "label": "URL",
        "navDescription": "Generar códigos QR para enlaces.",
        "title": "Generador de Códigos QR Gratis | Generar Códigos QR Personalizados en Línea",
        "description": "Genere y personalice fácilmente códigos QR para textos. Ideal para compartir contenido en línea, dirigir tráfico o mejorar materiales impresos. Rápido, gratis y sin necesidad de registro.",
        "input": "Ingrese la URL de su sitio web aquí"
      },
      "text": {
        "label": "Texto",
        "navDescription": "Codificar texto plano en códigos QR.",
        "title": "Generador de Códigos QR Gratis para Texto | Crear Códigos QR de Texto Personalizados",
        "description": "Genere y personalice fácilmente códigos QR para mensajes de texto. Perfecto para compartir información de manera rápida y eficiente. Rápido, gratis y sin necesidad de registro.",
        "input": "Ingrese su mensaje de texto aquí"
      },
      "phone": {
        "label": "Teléfono",
        "navDescription": "Generar códigos QR para marcar un número.",
        "title": "Generador de Códigos QR Gratis para Números de Teléfono | Crear Códigos QR de Teléfono Personalizados",
        "description": "Genere y personalice fácilmente códigos QR para números de teléfono. Ideal para compartir información de contacto al instante. Rápido, gratis y sin necesidad de registro.",
        "input": "Ingrese su número de teléfono aquí"
      },
      "docs": {
        "title": "🧾 Cómo Usar el Generador de Códigos QR de Rivine",
        "intro": "¡Genera un código QR en segundos! Ya sea que estés vinculando a un sitio web, compartiendo una nota rápida o incrustando un número de teléfono, todo está a solo unos clics de distancia.",
        "whatIs": {
          "title": "✨ ¿Qué es un Código QR?",
          "description": "Un código QR (Respuesta Rápida) es un tipo de código de barras que contiene información como enlaces, texto o detalles de contacto. Se puede escanear usando la cámara de tu teléfono o un escáner de códigos QR para acceder instantáneamente al contenido."
        },
        "whatCanYouCreate": {
          "title": "📦 ¿Qué Puedes Crear?",
          "url": {
            "title": "URL:",
            "description": "Enlace a sitios web, portafolios o aplicaciones."
          },
          "text": {
            "title": "Texto:",
            "description": "Mostrar mensajes, notas o códigos."
          },
          "phone": {
            "title": "Teléfono:",
            "description": "Incrusta un número para que los usuarios puedan tocar y llamar."
          }
        },
        "steps": {
          "title": "🚀 Cómo Generar un Código QR",
          "step1": {
            "title": "Paso 1: Elige lo que Quieres Codificar",
            "description": "Usa el menú a la izquierda para seleccionar URL, Texto o Teléfono."
          },
          "step2": {
            "title": "Paso 2: Escribe tu Contenido",
            "description": "Ingresa tu contenido en el campo de entrada. ¡El código QR se actualiza instantáneamente!"
          },
          "step3": {
            "title": "Paso 3: Previsualiza tu Código QR",
            "description": "Verás el código aparecer a la derecha, listo para escanear."
          },
          "step4": {
            "title": "Paso 4: Elige el Formato de Archivo",
            "description": "Elige PNG o SVG dependiendo de cómo lo usarás."
          },
          "step5": {
            "title": "Paso 5: Descarga",
            "description": "¡Haz clic en el botón y listo!"
          },
          "exampleLabel": "Ejemplo (URL):",
          "downloadButton": "Descargar"
        },
        "tips": {
          "title": "💡 Consejos Profesionales",
          "tip1": "Para imprimir, usa SVG para evitar bordes borrosos.",
          "tip2": "Deja algo de espacio en blanco alrededor del código QR para un mejor escaneo.",
          "tip3": "Asegúrate de que tu contenido sea preciso antes de compartirlo.",
          "tip4": "Prueba con la cámara de tu teléfono antes de publicarlo en cualquier lugar."
        },
        "troubleshooting": {
          "title": "🛠️ ¿Tienes Problemas?",
          "qrNotShowing": {
            "title": "¿El Código QR no se muestra?",
            "description": "Verifica que hayas escrito algo válido y seleccionado la pestaña correcta."
          },
          "downloadNotWorking": {
            "title": "¿La descarga no funciona?",
            "description": "Prueba otro formato o actualiza la página."
          }
        }
      }
    },
    "clock": {
      "title": "Reloj",
      "label": "Reloj",
      "navDescription": "Configura temporizadores para una variedad de tareas y actividades.",
      "subLabel": "Suite de Reloj",
      "subNavDescription": "Gestiona tu tiempo eficientemente con nuestro completo temporizador en línea.",
      "description": "Temporizador en línea: mide tiempo para tareas y entrenos. Personaliza alertas y duraciones según tus necesidades."
    },
    "timer": {
      "title": "Temporizador en línea",
      "label": "Temporizador",
      "navDescription": "Establezca temporizadores para varias tareas y actividades.",
      "subLabel": "Suite de herramientas de temporizador",
      "subNavDescription": "Gestione su tiempo de manera efectiva con nuestro temporizador en línea.",
      "description": "Temporizador online gratis: mide tiempo para tareas y entrenos. Personaliza alertas y duraciones.",
      "page": {
        "paused": "Pausado",
        "running": "En ejecución"
      },
      "dialog": {
        "title": "Configuración del temporizador",
        "presets": "Preajustes",
        "custom": "Duración personalizada",
        "pomodoro": "Pomodoro",
        "short": "Descanso corto",
        "focus": "Enfoque",
        "hours": "Horas",
        "min": "Minutos",
        "sec": "Segundos",
        "error": "Por favor, establezca una duración de tiempo"
      },
      "keywords": {
        "0": "Temporizador en línea",
        "1": "Temporizador gratuito",
        "2": "Temporizador de tareas",
        "3": "Temporizador de entrenamiento",
        "4": "Establecer temporizador",
        "5": "Temporizador de cuenta regresiva",
        "6": "Temporizador en línea"
      },
      "docs": {
        "title": "⏱️ Cómo Usar el Temporizador de Rivine",
        "intro": "Mantente productivo y gestiona tu tiempo de manera efectiva con nuestro temporizador personalizable. Perfecto para la técnica Pomodoro, sesiones de trabajo enfocadas y descansos programados.",
        "whatIs": {
          "title": "✨ ¿Qué es la Herramienta de Temporizador?",
          "description": "El Temporizador es una herramienta de gestión del tiempo simple pero poderosa que te ayuda a rastrear el tiempo para varias actividades. Con duraciones personalizables y preajustes para técnicas populares como Pomodoro, está diseñado para aumentar tu productividad y ayudar a mantener un equilibrio saludable entre trabajo y descanso."
        },
        "features": {
          "title": "📦 Características Clave",
          "visualTimer": {
            "title": "Indicador de Progreso Visual",
            "description": "Un anillo de progreso circular muestra tu tiempo restante de un vistazo."
          },
          "presets": {
            "title": "Preajustes de Productividad",
            "description": "Acceso rápido a duraciones de temporizador comunes como Pomodoro (25 min), Descanso Corto (5 min) y Enfoque (50 min)."
          },
          "custom": {
            "title": "Duración Personalizada",
            "description": "Establece horas, minutos y segundos precisos para tus necesidades de temporización específicas."
          },
          "controls": {
            "title": "Controles Intuitivos",
            "description": "Opciones simples de reproducir, pausar, reiniciar y configuraciones para una fácil gestión del temporizador."
          }
        },
        "presets": {
          "title": "⚡ Comprendiendo los Preajustes del Temporizador",
          "pomodoro": {
            "title": "Pomodoro (25 minutos)",
            "description": "Basado en la popular Técnica Pomodoro, este temporizador de 25 minutos está diseñado para sesiones de trabajo enfocadas, típicamente seguido de un descanso corto."
          },
          "shortBreak": {
            "title": "Descanso Corto (5 minutos)",
            "description": "Un descanso rápido de 5 minutos para descansar tu mente entre sesiones de trabajo. Perfecto después de una sesión Pomodoro."
          },
          "focus": {
            "title": "Enfoque (50 minutos)",
            "description": "Un período de enfoque extendido para un trabajo más profundo que requiere más atención sostenida."
          }
        },
        "steps": {
          "title": "🚀 Cómo Usar el Temporizador",
          "step1": {
            "title": "Paso 1: Elige una Duración del Temporizador",
            "description": "Selecciona entre las opciones preestablecidas (Pomodoro, Descanso Corto, Enfoque) o establece una duración personalizada."
          },
          "step2": {
            "title": "Paso 2: Inicia el Temporizador",
            "description": "Presiona el botón de reproducir para comenzar la cuenta regresiva. El círculo comenzará a llenarse para representar visualmente el tiempo transcurrido."
          },
          "step3": {
            "title": "Paso 3: Monitorea tu Progreso",
            "description": "Observa cómo el temporizador cuenta regresivamente y el indicador visual muestra tu tiempo restante."
          },
          "step4": {
            "title": "Paso 4: Gestiona tu Temporizador",
            "description": "Pausa, reanuda o reinicia el temporizador según sea necesario usando los botones de control."
          }
        },
        "controls": {
          "title": "🎮 Comprendiendo los Controles del Temporizador",
          "play": {
            "title": "Botón de Reproducir",
            "description": "Inicia o reanuda la cuenta regresiva del temporizador."
          },
          "pause": {
            "title": "Botón de Pausa",
            "description": "Detiene temporalmente el temporizador mientras conserva el tiempo restante."
          },
          "reset": {
            "title": "Botón de Reiniciar",
            "description": "Devuelve el temporizador a su duración inicial."
          },
          "settings": {
            "title": "Botón de Configuraciones",
            "description": "Abre el panel de configuraciones del temporizador para seleccionar preajustes o establecer duraciones personalizadas."
          }
        },
        "customTimer": {
          "title": "⚙️ Configurando un Temporizador Personalizado",
          "description": "¿Necesitas una duración específica no cubierta por los preajustes? Sigue estos pasos para crear un temporizador personalizado:",
          "step1": "Haz clic en el ícono de configuraciones (engranaje) para abrir Configuraciones del Temporizador.",
          "step2": "En 'Duración Personalizada', establece tus horas, minutos y segundos deseados usando las entradas numéricas.",
          "step3": "Haz clic en 'Guardar' para confirmar tu duración personalizada y regresar a la pantalla del temporizador."
        },
        "tips": {
          "title": "💡 Consejos Profesionales",
          "tip1": "Para una productividad óptima usando la Técnica Pomodoro, intenta 25 minutos de trabajo enfocado seguido de un descanso de 5 minutos, luego repite.",
          "tip2": "Después de completar cuatro sesiones Pomodoro, toma un descanso más largo de 15-30 minutos para recargar energías.",
          "tip3": "Minimiza las distracciones durante las sesiones de trabajo cronometradas cerrando aplicaciones innecesarias y poniendo tus dispositivos en modo 'No Molestar'."
        },
        "troubleshooting": {
          "title": "🛠️ ¿Tienes Problemas?",
          "timerNotStarting": {
            "title": "¿El Temporizador No Inicia?",
            "description": "Asegúrate de haber establecido una duración mayor a cero y haz clic en el botón de reproducir para comenzar la cuenta regresiva."
          },
          "notification": {
            "title": "¿No Puedes Escuchar la Finalización del Temporizador?",
            "description": "Sube el volumen para escuchar cuando el temporizador haya terminado."
          }
        }
      }
    },
    "utilities": {
      "title": "Utilidades",
      "label": "Utilidades",
      "navDescription": "Explora útiles utilidades en línea para diversas tareas cotidianas.",
      "subLabel": "Utilidades Web",
      "subNavDescription": "Generadores y herramientas para productividad y creatividad.",
      "description": "Desde generadores de contraseñas seguras hasta creadores de publicaciones divertidas, nuestra sección de utilidades está llena de herramientas web útiles."
    },
    "passwordGenerator": {
      "title": "Generador de Contraseñas Seguras",
      "label": "Generador de Contraseñas",
      "navDescription": "Cree contraseñas seguras y aleatorias para proteger sus cuentas.",
      "subLabel": "Suite de Generador de Contraseñas",
      "subNavDescription": "Genere contraseñas fuertes y únicas al instante.",
      "description": "Generador de contraseñas: crea contraseñas seguras y aleatorias. Personaliza longitud y caracteres según tus necesidades.",
      "keywords": {
        "0": "Generador de Contraseñas",
        "1": "Contraseñas Seguras",
        "2": "Crear Contraseña",
        "3": "Contraseña Aleatoria",
        "4": "Generar Contraseña",
        "5": "Contraseña Fuerte",
        "6": "Generador de Contraseñas en Línea"
      },
      "page": {
        "description": "Generar contraseñas únicas y fuertes",
        "generatePwd": "Regenerar Contraseña",
        "strong": {
          "label": "Fuerte",
          "message": "¡Excelente elección!"
        },
        "moderate": {
          "label": "Moderado",
          "message": "No está mal, pero tampoco es Fort Knox."
        },
        "weak": {
          "label": "Débil",
          "message": "Necesita mejora."
        },
        "pwLength": "Longitud de la contraseña",
        "form": {
          "uppercase": "Incluir letras mayúsculas",
          "lowercase": "Incluir letras minúsculas",
          "numbers": "Incluir números",
          "symbols": "Incluir símbolos"
        }
      },
      "autoGenerationMessage": "Su contraseña se generará automáticamente",
      "length": {
        "label": "Longitud",
        "navDescription": "Seleccione la longitud de la contraseña.",
        "title": "Generador de Contraseñas Seguras | Personalizar Longitud de Contraseña",
        "description": "Elija la longitud de su contraseña para garantizar la seguridad adecuada. Recomendado: al menos 12 caracteres.",
        "input": "Ingrese la longitud de la contraseña aquí"
      },
      "characters": {
        "label": "Caracteres",
        "navDescription": "Seleccione los tipos de caracteres para incluir.",
        "title": "Generador de Contraseñas Seguras | Personalizar Caracteres de Contraseña",
        "description": "Seleccione los tipos de caracteres que desea incluir en su contraseña: letras, números, símbolos.",
        "input": "Seleccione los caracteres deseados"
      },
      "docs": {
        "title": "🔐 Cómo Usar el Generador de Contraseñas de Rivine",
        "intro": "¡Genera contraseñas fuertes y seguras en segundos! Personaliza la longitud, los tipos de caracteres y regenera contraseñas con solo un clic.",
        "whatIs": {
          "title": "✨ ¿Qué es un Generador de Contraseñas?",
          "description": "Un generador de contraseñas crea contraseñas aleatorias y fuertes para asegurar tus cuentas. Puedes elegir tipos de caracteres específicos, como letras mayúsculas, números, símbolos y más para satisfacer tus necesidades de seguridad."
        },
        "features": {
          "title": "📦 Características del Generador de Contraseñas",
          "length": {
            "title": "Longitud Ajustable:",
            "description": "Establece la longitud deseada de la contraseña para que coincida con tus preferencias de seguridad."
          },
          "uppercase": {
            "title": "Incluir Letras Mayúsculas:",
            "description": "Opcionalmente incluye letras mayúsculas en tu contraseña."
          },
          "lowercase": {
            "title": "Incluir Letras Minúsculas:",
            "description": "Opcionalmente incluye letras minúsculas en tu contraseña."
          },
          "numbers": {
            "title": "Incluir Números:",
            "description": "Incluye dígitos para mayor complejidad."
          },
          "symbols": {
            "title": "Incluir Símbolos:",
            "description": "Agrega caracteres especiales como !, @, #, etc., para hacer tu contraseña más segura."
          }
        },
        "steps": {
          "title": "🚀 Cómo Generar una Contraseña",
          "step1": {
            "title": "Paso 1: Establece la Longitud de tu Contraseña",
            "description": "Usa el deslizador para ajustar la longitud de tu contraseña. Cuanto más larga sea la contraseña, más segura será."
          },
          "step2": {
            "title": "Paso 2: Elige tus Tipos de Caracteres",
            "description": "Activa o desactiva para incluir letras mayúsculas, letras minúsculas, números y símbolos."
          },
          "step3": {
            "title": "Paso 3: Genera tu Contraseña",
            "description": "Haz clic en el botón 'Generar' para crear una contraseña aleatoria y segura basada en tus configuraciones elegidas."
          },
          "step4": {
            "title": "Paso 4: Copia o Regenera la Contraseña",
            "description": "Una vez generada tu contraseña, haz clic en el botón 'Copiar' para guardarla o 'Regenerar' para crear una nueva."
          }
        },
        "exampleLabel": "Contraseña de Ejemplo:",
        "copyButton": "Copiar",
        "regenerateButton": "Regenerar",
        "tips": {
          "title": "💡 Consejos Profesionales",
          "tip1": "Para una mejor seguridad, usa una longitud de contraseña de al menos 12 caracteres.",
          "tip2": "Incluir una mezcla de mayúsculas, minúsculas, números y símbolos aumenta la fortaleza de la contraseña.",
          "tip3": "Evita reutilizar contraseñas en diferentes sitios — crea una contraseña única para cada cuenta."
        },
        "troubleshooting": {
          "title": "🛠️ ¿Tienes Problemas?",
          "lengthError": {
            "title": "¿Error de Longitud de Contraseña?",
            "description": "Asegúrate de que la longitud de tu contraseña sea de al menos 8 caracteres para garantizar una seguridad adecuada."
          },
          "generationError": {
            "title": "¿No se Genera la Contraseña?",
            "description": "Verifica que todos los campos requeridos estén seleccionados y que la longitud sea apropiada."
          }
        }
      }
    },
    "text": {
      "title": "Suite de Texto",
      "label": "Texto",
      "navDescription": "Accede a una suite completa de herramientas de texto para todas tus necesidades de procesamiento de texto.",
      "subLabel": "Suite de Texto Completa",
      "subNavDescription": "Explora una variedad de herramientas para gestionar, comparar y analizar texto.",
      "description": "Nuestra Suite de Herramientas de Texto ofrece una amplia gama de utilidades para manejar tareas de procesamiento de texto de manera eficiente. Desde la comparación hasta el análisis, personaliza tu experiencia para satisfacer tus requisitos específicos."
    },
    "textCompare": {
      "title": "Comparación de Texto Gratis",
      "label": "Comparar Texto",
      "navDescription": "Compara dos textos para identificar diferencias y similitudes.",
      "subLabel": "Suite de Comparación de Texto",
      "subNavDescription": "Compara y analiza diferencias de texto sin esfuerzo.",
      "description": "Compara textos gratis: detecta diferencias y similitudes. Personaliza para resaltar cambios.",
      "keywords": {
        "0": "Comparar Texto",
        "1": "Comparar Textos",
        "2": "Diferencias de Texto",
        "3": "Similitudes de Texto",
        "4": "Comparación de Texto en Línea",
        "5": "Análisis de Texto",
        "6": "Comparar Documentos"
      },
      "page": {
        "description": "Compara y analiza diferencias de texto",
        "compareText": "Comparar Textos",
        "select": {
          "char": "Carácter por Carácter",
          "word": "Palabra por Palabra",
          "line": "Línea por Línea"
        },
        "identical": "Los dos textos son idénticos",
        "diff": "diferencias encontradas",
        "textPlaceholder": "Introduce o pega texto aquí...",
        "mergeL": "Unir a la Izquierda",
        "mergeR": "Unir a la Derecha",
        "compare": "Comparar",
        "left": "Texto Izquierdo",
        "right": "Texto Derecho",
        "realTime": "Vista en tiempo real"
      },
      "docs": {
        "title": "🔍 Cómo Usar la Herramienta de Comparación de Texto de Rivine",
        "intro": "Compara dos textos lado a lado para detectar fácilmente diferencias, analizar cambios y fusionar contenido sin esfuerzo.",
        "whatIs": {
          "title": "✨ ¿Qué es la Herramienta de Comparación de Texto?",
          "description": "La herramienta de Comparación de Texto es una utilidad poderosa que te permite identificar y visualizar diferencias entre dos documentos de texto. Ya sea que estés comparando versiones de código, documentos o cualquier contenido de texto, resalta cambios a nivel de carácter, palabra o línea para ayudarte a entender exactamente qué ha cambiado."
        },
        "features": {
          "title": "📦 Características Clave",
          "dualView": {
            "title": "Editor de Texto Dual",
            "description": "Áreas de texto lado a lado para una fácil comparación del contenido izquierdo y derecho."
          },
          "comparisonModes": {
            "title": "Múltiples Modos de Comparación",
            "description": "Elige entre métodos de comparación Carácter por Carácter, Palabra por Palabra o Línea por Línea."
          },
          "realTime": {
            "title": "Vista en Tiempo Real",
            "description": "Activa la comparación en tiempo real para ver las diferencias mientras escribes."
          },
          "fileUpload": {
            "title": "Carga de Archivos",
            "description": "Importa archivos de texto directamente en el editor izquierdo o derecho."
          },
          "merging": {
            "title": "Fusión de Texto",
            "description": "Fusiona cambios de un lado a otro con botones de fusión dedicados."
          }
        },
        "comparisonModes": {
          "title": "🔄 Entendiendo los Modos de Comparación",
          "character": {
            "title": "Carácter por Carácter",
            "description": "El método de comparación más detallado, resaltando diferencias a nivel de carácter individual. Perfecto para detectar pequeños errores tipográficos o cambios menores de texto."
          },
          "word": {
            "title": "Palabra por Palabra",
            "description": "Compara texto tratando las palabras como unidades. Este modo es ideal para la edición de documentos y revisiones de contenido donde a menudo se agregan, eliminan o cambian palabras completas."
          },
          "line": {
            "title": "Línea por Línea",
            "description": "Compara texto línea por línea, similar a cómo funcionan las diferencias de código. Mejor para contenido estructurado como código, listas o cualquier texto donde los saltos de línea son significativos."
          }
        },
        "steps": {
          "title": "🚀 Cómo Comparar Textos",
          "step1": {
            "title": "Paso 1: Agrega Tus Textos",
            "description": "Ingresa o pega tu texto original en el editor izquierdo y el texto con el que deseas compararlo en el editor derecho. Alternativamente, usa los botones de Carga para importar archivos de texto."
          },
          "step2": {
            "title": "Paso 2: Selecciona el Modo de Comparación",
            "description": "Elige si deseas comparar Carácter por Carácter, Palabra por Palabra o Línea por Línea desde el menú desplegable."
          },
          "step3": {
            "title": "Paso 3: Activa la Vista en Tiempo Real (Opcional)",
            "description": "Habilita la vista en tiempo real si deseas que las diferencias se resalten automáticamente mientras escribes."
          },
          "step4": {
            "title": "Paso 4: Revisa las Diferencias",
            "description": "Las diferencias se resaltarán con rojo indicando contenido eliminado y verde indicando contenido agregado. El panel inferior muestra una comparación línea por línea para una inspección más detallada."
          }
        },
        "merging": {
          "title": "🔀 Fusionando Cambios",
          "description": "La herramienta de Comparación de Texto te permite fusionar cambios entre los editores de texto izquierdo y derecho:",
          "mergeToRight": {
            "title": "Fusionar a la Derecha",
            "description": "Copia contenido del editor izquierdo al editor derecho, sobrescribiendo el texto derecho con el texto izquierdo."
          },
          "mergeToLeft": {
            "title": "Fusionar a la Izquierda",
            "description": "Copia contenido del editor derecho al editor izquierdo, sobrescribiendo el texto izquierdo con el texto derecho."
          }
        },
        "exampleLabel": "Ejemplo de Comparación:",
        "exampleLeft": "Texto Izquierdo:",
        "exampleRight": "Texto Derecho:",
        "exampleNote": "En este ejemplo, 'antiguo' ha sido reemplazado por 'actualizado', mostrado con resaltado rojo para contenido eliminado y verde para contenido agregado.",
        "tips": {
          "title": "💡 Consejos Profesionales",
          "tip1": "Para la comparación de código, el modo Línea por Línea generalmente funciona mejor para coincidir con cómo los sistemas de control de versiones muestran las diferencias.",
          "tip2": "Al comparar documentos largos, intenta primero el modo Palabra por Palabra para obtener una visión más clara de los cambios sustanciales.",
          "tip3": "Usa el botón 'Cargar' para comparar rápidamente archivos de tu sistema local sin copiar y pegar.",
          "tip4": "Para la comparación más precisa al trabajar con texto formateado, primero elimina cualquier formato pegando como texto sin formato."
        },
        "troubleshooting": {
          "title": "🛠️ ¿Tienes Problemas?",
          "largeFiles": {
            "title": "Rendimiento con Archivos Grandes",
            "description": "Si comparar textos muy grandes causa lentitud, intenta desactivar la comparación en tiempo real y usa la comparación manual en su lugar."
          },
          "formatting": {
            "title": "Problemas de Formato",
            "description": "La herramienta compara solo texto sin formato. Si el formato aparece diferente, asegúrate de estar pegando como texto sin formato sin caracteres de formato ocultos."
          },
          "encoding": {
            "title": "Problemas de Codificación de Caracteres",
            "description": "Si los caracteres especiales aparecen de manera diferente en los dos textos a pesar de ser idénticos, verifica que ambos textos usen la misma codificación de caracteres."
          }
        }
      }
    },
    "json": {
      "title": "JSON",
      "label": "Herramientas JSON",
      "navDescription": "Suite integral para todas tus necesidades de JSON.",
      "subLabel": "Suite Completa de JSON",
      "subNavDescription": "Maneja, edita y formatea datos JSON sin esfuerzo.",
      "description": "Explora nuestra suite integral de herramientas JSON en línea gratuitas para editar, formatear, validar y analizar datos JSON. Personaliza la configuración para mejorar tu experiencia de manejo de JSON."
    },
    "jsonEditor": {
      "title": "Editor JSON Gratis",
      "label": "Editor JSON",
      "navDescription": "Edita y formatea datos JSON con facilidad.",
      "subLabel": "Suite de Editor JSON",
      "subNavDescription": "Edita y formatea datos JSON sin esfuerzo.",
      "description": "Editor JSON gratis: edita y formatea datos. Personaliza para mejorar tu experiencia.",
      "keywords": {
        "0": "Editor JSON",
        "1": "Editar JSON",
        "2": "Formateador JSON",
        "3": "Embellecedor JSON",
        "4": "Editor JSON en línea",
        "5": "Validador JSON",
        "6": "Analizador JSON",
        "7": "Comprobador de sintaxis JSON",
        "8": "Visor JSON",
        "9": "Minificador JSON",
        "10": "Impresión bonita JSON"
      },
      "docs": {
        "title": "🧩 Cómo Usar el Editor de JSON de Rivine",
        "intro": "Edita, formatea y transforma datos JSON con facilidad. La interfaz de doble editor te permite trabajar con múltiples documentos JSON simultáneamente con potentes funciones de visualización y edición.",
        "whatIs": {
          "title": "✨ ¿Qué es un Editor de JSON?",
          "description": "Un Editor de JSON es una herramienta que te ayuda a crear, editar y validar datos JSON (JavaScript Object Notation). Nuestro editor proporciona múltiples vistas y potentes características para facilitar y hacer eficiente el trabajo con JSON."
        },
        "features": {
          "title": "📦 Características Principales",
          "dualEditor": {
            "title": "Interfaz de Doble Editor",
            "description": "Trabaja con dos documentos JSON uno al lado del otro, facilitando la comparación, copia o fusión de contenido entre ellos."
          },
          "viewModes": {
            "title": "Múltiples Modos de Vista",
            "description": "Cambia entre los modos Código, Árbol, Tabla y Vista Previa para visualizar tus datos JSON en el formato más útil."
          },
          "formatting": {
            "title": "Formatear y Embellecer",
            "description": "Formatea e indenta automáticamente tu JSON para una mejor legibilidad con un solo clic."
          },
          "search": {
            "title": "Buscar y Reemplazar",
            "description": "Encuentra y reemplaza rápidamente valores dentro de tus documentos JSON, con soporte para expresiones regulares."
          },
          "transform": {
            "title": "Transformar y Manipular",
            "description": "Ordena, filtra y transforma tus datos JSON usando herramientas de transformación integradas."
          }
        },
        "modes": {
          "title": "📋 Modos de Vista Explicados",
          "code": {
            "title": "Modo Código",
            "description": "Edita texto JSON en bruto con resaltado de sintaxis, autocompletado y detección de errores."
          },
          "tree": {
            "title": "Modo Árbol",
            "description": "Navega y edita JSON como una estructura de árbol colapsable, perfecto para datos anidados."
          },
          "table": {
            "title": "Modo Tabla",
            "description": "Visualiza y edita arreglos JSON como tablas con columnas ordenables."
          },
          "preview": {
            "title": "Modo Vista Previa",
            "description": "Ve una vista formateada y de solo lectura de tus datos JSON, ideal para revisar contenido."
          }
        },
        "steps": {
          "title": "🚀 Cómo Usar el Editor de JSON",
          "step1": {
            "title": "Paso 1: Introduce o Importa JSON",
            "description": "Escribe directamente en el editor, pega desde el portapapeles o importa un archivo JSON desde tu dispositivo."
          },
          "step2": {
            "title": "Paso 2: Elige Tu Modo de Vista",
            "description": "Selecciona entre los modos Código, Árbol, Tabla o Vista Previa según tus necesidades de edición."
          },
          "step3": {
            "title": "Paso 3: Edita y Transforma",
            "description": "Modifica tus datos JSON usando las características del editor, incluyendo agregar, editar o eliminar propiedades."
          },
          "step4": {
            "title": "Paso 4: Exporta o Copia",
            "description": "Copia tu JSON al portapapeles o expórtalo como un archivo una vez que hayas completado tus ediciones."
          }
        },
        "advancedFeatures": {
          "title": "🔧 Características Avanzadas",
          "filter": {
            "title": "Filtrado Basado en Consultas",
            "description": "Filtra documentos JSON grandes usando expresiones de consulta para enfocarte en datos específicos."
          },
          "sort": {
            "title": "Ordenar Claves y Valores",
            "description": "Organiza tu JSON ordenando claves alfabéticamente o valores numéricamente."
          },
          "transform": {
            "title": "Transformación de JSON",
            "description": "Aplica transformaciones como aplanar estructuras anidadas, convertir tipos o reestructurar datos."
          },
          "repair": {
            "title": "Reparar JSON Malformado",
            "description": "Repara automáticamente errores de sintaxis comunes en documentos JSON malformados."
          },
          "navigation": {
            "title": "Navegación por Rutas",
            "description": "Navega por estructuras JSON complejas usando expresiones de ruta para localizar rápidamente nodos específicos."
          }
        },
        "exampleLabel": "JSON de Ejemplo:",
        "tips": {
          "title": "💡 Consejos Profesionales",
          "tip1": "Usa atajos de teclado (Ctrl+F para buscar, Ctrl+I para formatear) para acelerar tu flujo de trabajo.",
          "tip2": "Para archivos JSON grandes, la vista Árbol puede ayudarte a navegar y entender la estructura mejor que la vista Código.",
          "tip3": "Al comparar dos documentos JSON, usa el diseño de doble editor y la función de sincronización de desplazamiento.",
          "tip4": "Usa la función 'Copiar Ruta' para obtener la ruta JSON exacta a un valor específico, útil para APIs y documentación."
        },
        "troubleshooting": {
          "title": "🛠️ ¿Tienes Problemas?",
          "invalidJson": {
            "title": "¿Error de JSON Inválido?",
            "description": "Verifica comas faltantes, comas adicionales o corchetes sin cerrar. El editor resaltará errores de sintaxis para ayudarte a identificar problemas."
          },
          "performance": {
            "title": "¿El Editor Funciona Lentamente?",
            "description": "Para archivos JSON muy grandes (más de 1MB), considera usar el modo Código en lugar del modo Árbol para un mejor rendimiento."
          },
          "dataLoss": {
            "title": "¿Preocupado por la Pérdida de Datos?",
            "description": "Usa la función 'Guardar en Almacenamiento Local' para respaldar automáticamente tu trabajo mientras editas."
          }
        }
      }
    },
    "image": {
      "title": "Suite de Imágenes",
      "label": "Imagen",
      "navDescription": "Accede a una suite completa de herramientas de imagen para todas tus necesidades de procesamiento de imágenes.",
      "subLabel": "Suite Completa de Imágenes",
      "subNavDescription": "Explora una variedad de herramientas para gestionar, editar y analizar imágenes.",
      "description": "Nuestra Suite de Herramientas de Imágenes ofrece una amplia gama de utilidades para manejar tareas de procesamiento de imágenes de manera eficiente. Desde la edición hasta el análisis, personaliza tu experiencia para satisfacer tus requisitos específicos."
    },
    "imageMerge": {
      "title": "Herramienta de Fusión de Imágenes",
      "label": "Fusión de Imágenes",
      "navDescription": "Combina múltiples imágenes en una sola imagen sin esfuerzo.",
      "subLabel": "Suite de Fusión de Imágenes",
      "subNavDescription": "Fusiona fácilmente múltiples imágenes en una.",
      "description": "Fusiona imágenes fácilmente: combina varias en una. Personaliza para mejorar tu experiencia.",
      "keywords": {
        "0": "Fusión de Imágenes",
        "1": "Combinar Imágenes",
        "2": "Combinador de Imágenes",
        "3": "Fusionar Fotos",
        "4": "Fusión de Imágenes en Línea",
        "5": "Costura de Imágenes",
        "6": "Collage de Fotos",
        "7": "Unidor de Imágenes",
        "8": "Fusión de Imágenes",
        "9": "Fusión de Fotos",
        "10": "Superposición de Imágenes",
        "11": "Mezclador de Fotos",
        "12": "Montaje de Imágenes",
        "13": "Composición de Imágenes",
        "14": "Costura de Fotos",
        "15": "Creador de Collages de Imágenes",
        "16": "Editor de Fotos",
        "17": "Editor de Imágenes",
        "18": "Manipulación de Imágenes",
        "19": "Fusión de Fotos",
        "20": "Agregador de Imágenes",
        "21": "Unidor de Fotos",
        "22": "Diseño de Imágenes",
        "23": "Combinación de Imágenes",
        "24": "Fusión de Fotos",
        "25": "Fusión de Chats de Whatsapp"
      },
      "page": {
        "title": "Fusión de Imágenes",
        "description": "Fusiona fácilmente múltiples imágenes en una",
        "image": "Imagen",
        "upload": "Subir imagen",
        "size": "Tamaño de la imagen",
        "selectSize": "Seleccionar tamaño",
        "sizeOriginal": "Tamaño Original",
        "sizeMagnify": "Ampliar",
        "sizeCrop": "Recortar",
        "settings": "Configuración de Fusión",
        "noImages": "Número de Imágenes",
        "positionTab": "Posición",
        "borderTab": "Borde",
        "imagePosition": "Posición de la Imagen",
        "selectPosition": "Seleccionar posición",
        "horizontal": "Horizontal (Lado a Lado)",
        "vertical": "Vertical (Una Sobre Otra)",
        "sizeNor": "Normalización de Tamaño",
        "selNorm": "Seleccionar normalización",
        "selNone": "Ninguna (Mantener Proporciones Originales)",
        "largest": "Ajustar a la Imagen Más Grande",
        "smallest": "Ajustar a la Imagen Más Pequeña",
        "borderType": "Tipo de Borde",
        "selBorder": "Seleccionar tipo de borde",
        "between": "Entre Imágenes",
        "aroundEach": "Alrededor de Cada Imagen",
        "aroundAll": "Alrededor del Resultado Fusionado",
        "borderStyle": "Estilo de Borde",
        "selStyle": "Seleccionar estilo de borde",
        "solid": "Sólido",
        "dashed": "Discontinuo",
        "dotted": "Punteado",
        "borderWidth": "Ancho del Borde",
        "borderColor": "Color del Borde",
        "result": "Resultado Fusionado",
        "error": "Sube al menos una imagen para ver el resultado fusionado",
        "download": "Descargar Imagen Fusionada",
        "tune": "Ajusta la configuración de fusión para lograr el resultado deseado"
      },
      "docs": {
        "title": "🖼️ Cómo Usar la Herramienta de Fusión de Imágenes",
        "intro": "Combina fácilmente múltiples imágenes en una sola imagen compuesta con diseños y configuraciones personalizables.",
        "whatIs": {
          "title": "✨ ¿Qué es la Herramienta de Fusión de Imágenes?",
          "description": "La herramienta de Fusión de Imágenes es una utilidad poderosa que te permite combinar múltiples imágenes en una sola imagen compuesta. Ya sea que necesites crear collages, imágenes de comparación o pantallas multipanel, esta herramienta te ayuda a organizar y fusionar imágenes con opciones de posicionamiento y formato personalizables."
        },
        "features": {
          "title": "📦 Características Clave",
          "multipleImages": {
            "title": "Soporte de Múltiples Imágenes",
            "description": "Combina entre 2 y 10 imágenes en una sola salida fusionada."
          },
          "positionOptions": {
            "title": "Posicionamiento Flexible",
            "description": "Organiza imágenes horizontalmente una al lado de la otra, apiladas verticalmente o en un diseño de cuadrícula."
          },
          "sizeControl": {
            "title": "Normalización de Tamaño",
            "description": "Elige cómo se dimensionan las imágenes en relación entre sí al fusionar."
          },
          "borderOptions": {
            "title": "Personalización de Bordes",
            "description": "Agrega y personaliza bordes entre imágenes para una separación clara."
          },
          "imageSettings": {
            "title": "Configuraciones de Imagen Individual",
            "description": "Controla el tamaño y la apariencia de cada imagen de forma independiente."
          }
        },
        "steps": {
          "title": "🚀 Cómo Fusionar Imágenes",
          "step1": {
            "title": "Paso 1: Sube Tus Imágenes",
            "description": "Haz clic en el botón 'Subir imagen' en cada panel de imagen para agregar tus imágenes de origen. Necesitas al menos 2 imágenes para realizar una fusión."
          },
          "step2": {
            "title": "Paso 2: Establece el Número de Imágenes",
            "description": "Usa los botones '+' y '-' para ajustar el número de imágenes que deseas fusionar (mínimo 2, máximo 10)."
          },
          "step3": {
            "title": "Paso 3: Elige la Posición de la Imagen",
            "description": "Selecciona el estilo de disposición del menú desplegable 'Posición de Imagen': Horizontal (una al lado de la otra), Vertical (apiladas) o Diseño de Cuadrícula."
          },
          "step4": {
            "title": "Paso 4: Ajusta la Normalización de Tamaño",
            "description": "Selecciona cómo deben dimensionarse las imágenes en relación entre sí. Las opciones incluyen 'Ajustar a la Imagen Más Pequeña', 'Igualar Imagen Más Grande' o 'Mantener Tamaños Originales'."
          },
          "step5": {
            "title": "Paso 5: Configura los Ajustes de Bordes (Opcional)",
            "description": "Haz clic en la pestaña 'Borde' para agregar y personalizar bordes entre imágenes, incluyendo el ancho, color y estilo del borde."
          },
          "step6": {
            "title": "Paso 6: Previsualiza y Descarga",
            "description": "El resultado fusionado se mostrará automáticamente. Cuando estés satisfecho con el resultado, descarga tu imagen fusionada."
          }
        },
        "positionModes": {
          "title": "🔄 Opciones de Posición de Imagen",
          "horizontal": {
            "title": "Horizontal (Una al Lado de la Otra)",
            "description": "Coloca imágenes una al lado de la otra en una fila. Ideal para comparar imágenes lado a lado o crear composiciones panorámicas."
          },
          "vertical": {
            "title": "Vertical (Apiladas)",
            "description": "Apila imágenes una encima de la otra. Ideal para comparaciones de antes y después o pantallas secuenciales."
          },
          "grid": {
            "title": "Diseño de Cuadrícula",
            "description": "Organiza imágenes en un patrón de cuadrícula. Perfecto para crear collages o cuando trabajas con varias imágenes de importancia similar."
          }
        },
        "sizeOptions": {
          "title": "📏 Opciones de Normalización de Tamaño",
          "fitToSmallest": {
            "title": "Ajustar a la Imagen Más Pequeña",
            "description": "Escala todas las imágenes para que coincidan con las dimensiones de la imagen más pequeña. Asegura consistencia pero puede reducir imágenes más grandes."
          },
          "matchLargest": {
            "title": "Igualar Imagen Más Grande",
            "description": "Escala todas las imágenes para que coincidan con las dimensiones de la imagen más grande. Preserva detalles en imágenes grandes pero aumenta el tamaño del archivo de salida."
          },
          "originalSize": {
            "title": "Mantener Tamaños Originales",
            "description": "Mantiene las dimensiones originales de cada imagen. Resulta en una composición asimétrica pero preserva todos los detalles originales."
          }
        },
        "borderOptions": {
          "title": "🖌️ Personalización de Bordes",
          "width": {
            "title": "Ancho del Borde",
            "description": "Establece el grosor de los bordes entre imágenes de 0 (sin borde) hasta 20 píxeles."
          },
          "color": {
            "title": "Color del Borde",
            "description": "Elige cualquier color para los bordes para complementar tus imágenes o crear separación visual."
          },
          "style": {
            "title": "Estilo del Borde",
            "description": "Selecciona estilos de borde que incluyen líneas sólidas, discontinuas o punteadas."
          }
        },
        "imageLimit": {
          "title": "📱 Límites de Imágenes",
          "description": "La herramienta de Fusión de Imágenes requiere un mínimo de 2 imágenes y permite un máximo de 10 imágenes para combinarse a la vez."
        },
        "tips": {
          "title": "💡 Consejos Profesionales",
          "tip1": "Para obtener los mejores resultados al usar el modo 'Una al Lado de la Otra', elige imágenes con alturas similares.",
          "tip2": "Al crear una pila vertical, las imágenes con anchos similares funcionan mejor juntas.",
          "tip3": "El diseño de cuadrícula organiza automáticamente las imágenes en la formación más equilibrada según el número de imágenes.",
          "tip4": "Agregar un borde puede ayudar a distinguir entre imágenes con colores o contenido similares.",
          "tip5": "Considera usar 'Ajustar a la Imagen Más Pequeña' para un procesamiento más rápido y tamaños de archivo más pequeños."
        },
        "troubleshooting": {
          "title": "🛠️ ¿Tienes Problemas?",
          "notMerging": {
            "title": "Imágenes No Se Fusionan",
            "description": "Asegúrate de haber subido al menos dos archivos de imagen válidos. La vista previa de la fusión se muestra automáticamente una vez que se cargan suficientes imágenes."
          },
          "qualityIssues": {
            "title": "Pérdida de Calidad",
            "description": "Si las imágenes fusionadas parecen de menor calidad que las originales, intenta las configuraciones 'Mantener Tamaños Originales' o 'Igualar Imagen Más Grande' para preservar los detalles."
          },
          "layoutProblems": {
            "title": "Problemas de Diseño",
            "description": "Si el diseño fusionado no se ve bien, intenta una configuración de posición diferente o normaliza los tamaños de las imágenes para una composición más equilibrada."
          }
        }
      }
    },
    "textToHandwriting": {
      "title": "Herramienta de Texto a Escritura a Mano",
      "label": "Texto a Escritura a Mano",
      "navDescription": "Convierte texto mecanografiado en escritura a mano realista sin esfuerzo.",
      "subLabel": "Suite de Escritura a Mano",
      "subNavDescription": "Transforma fácilmente texto en notas escritas a mano.",
      "description": "Convierte texto a escritura a mano realista. Personaliza para mejorar tu experiencia.",
      "keywords": {
        "0": "Texto a Escritura a Mano",
        "1": "Convertidor de Escritura a Mano",
        "2": "Texto a Guion",
        "3": "Notas Escritas a Mano",
        "4": "Herramienta de Escritura a Mano en Línea",
        "5": "Texto a Cursiva",
        "6": "Generador de Escritura a Mano",
        "7": "Texto a Caligrafía",
        "8": "Convertidor de Guion",
        "9": "Texto a Caligrafía",
        "10": "Simulación de Escritura a Mano",
        "11": "Texto a Manuscrito",
        "12": "Creador de Escritura a Mano",
        "13": "Texto a Letra",
        "14": "Estilo de Escritura a Mano",
        "15": "Texto a Tinta",
        "16": "Editor de Escritura a Mano",
        "17": "Texto a Fuente",
        "18": "Personalización de Escritura a Mano",
        "19": "Texto a Escritura",
        "20": "Transformación de Escritura a Mano",
        "21": "Texto a Manuscrito",
        "22": "Creador de Guion",
        "23": "Convertidor de Texto a Escritura a Mano",
        "24": "Generador de Texto a Escritura a Mano",
        "25": "Editor de Texto a Escritura a Mano"
      },
      "page": {
        "title": "Texto a Escritura a Mano",
        "description": "Convierte fácilmente texto mecanografiado en escritura a mano realista",
        "yourText": "Tu Texto",
        "font": "Fuente de Escritura a Mano",
        "selFont": "Seleccionar fuente",
        "pageSize": "Tamaño de Página",
        "selPSize": "Seleccionar tamaño de página",
        "fontSize": "Tamaño de Fuente",
        "lineSpacing": "Espaciado de Líneas",
        "verticalPosition": "Posición Vertical",
        "wordSpacing": "Espaciado de Palabras",
        "letterSpacing": "Espaciado de Letras",
        "leftMargin": "Margen Izquierdo",
        "topMargin": "Margen Superior",
        "inkColor": "Color de Tinta",
        "pageBackground": "Fondo de Página",
        "marginColor": "Color del Margen",
        "lineColor": "Color de Línea",
        "showMargin": "Mostrar Margen",
        "showPageLines": "Mostrar Líneas de Página",
        "addToBook": "Agregar al Libro",
        "downloadAsImage": "Descargar como Imagen",
        "downloadAsPdf": "Descargar como PDF",
        "downloadAllImages": "Descargar Todas las Imágenes",
        "emptyBook": "Tu libro está vacío",
        "empBookDes": "Agrega páginas desde el editor o sube imágenes para crear tu libro",
        "page": "Página",
        "handwrittenText": "Texto Escrito a Mano",
        "image": "Imagen",
        "note": "Si las líneas o el texto se superponen, ajusta las configuraciones. Para descargar múltiples páginas, usa \"Agregar al Libro\" y desplázate hacia abajo para descargar."
      },
      "docs": {
        "title": "🖋️ Cómo Usar la Herramienta de Texto a Manuscrito",
        "intro": "Convierte texto mecanografiado en escritura a mano realista con estilos personalizables y opciones de formato.",
        "whatIs": {
          "title": "✨ ¿Qué es la Herramienta de Texto a Manuscrito?",
          "description": "La herramienta de Texto a Manuscrito es una utilidad versátil que transforma texto digital en contenido manuscrito de apariencia auténtica. Ya sea que estés creando notas, cartas, materiales de estudio o proyectos creativos, esta herramienta le da a tu texto digital un toque personal manuscrito con varias opciones de personalización."
        },
        "features": {
          "title": "📦 Características Clave",
          "fonts": {
            "title": "Fuentes de Escritura a Mano Realistas",
            "description": "Elige entre múltiples estilos de escritura a mano para encontrar el ajuste perfecto para tus necesidades."
          },
          "customization": {
            "title": "Apariencia Personalizable",
            "description": "Ajusta el tamaño de fuente, el espaciado, los márgenes y la posición para crear el aspecto manuscrito ideal."
          },
          "colorOptions": {
            "title": "Opciones de Color",
            "description": "Personaliza el color de la tinta, el fondo de la página y los colores de las líneas según tus preferencias."
          },
          "pageFormat": {
            "title": "Control de Formato de Página",
            "description": "Selecciona tamaños de papel y alterna elementos de página como márgenes y líneas."
          },
          "multiPage": {
            "title": "Soporte de Múltiples Páginas",
            "description": "Crea y gestiona múltiples páginas de contenido manuscrito en un solo documento."
          },
          "exportOptions": {
            "title": "Opciones de Exportación",
            "description": "Descarga páginas individuales como imágenes o compila múltiples páginas en un solo libro PDF."
          }
        },
        "steps": {
          "title": "🚀 Cómo Usar la Herramienta",
          "step1": {
            "title": "Paso 1: Ingresa Tu Texto",
            "description": "Escribe o pega tu texto en el área del editor en el lado izquierdo de la pantalla. El texto se renderizará como escritura a mano en el panel de vista previa a la derecha."
          },
          "step2": {
            "title": "Paso 2: Selecciona el Estilo de Escritura a Mano",
            "description": "Elige tu estilo de escritura a mano preferido del menú desplegable 'Fuente de Escritura a Mano'. Cada fuente proporciona una apariencia manuscrita única."
          },
          "step3": {
            "title": "Paso 3: Personaliza el Formato",
            "description": "Ajusta el tamaño de fuente, el espaciado de líneas, el espaciado de palabras, el espaciado de letras, los márgenes y el tamaño de la página para perfeccionar tu documento manuscrito."
          },
          "step4": {
            "title": "Paso 4: Personaliza los Colores",
            "description": "Elige colores para la tinta, el fondo de la página, las líneas y el margen para crear tu estética deseada."
          },
          "step5": {
            "title": "Paso 5: Alterna Elementos Visuales",
            "description": "Usa los interruptores para mostrar u ocultar márgenes de página y líneas según tu preferencia."
          }
        },
        "multiPage": {
          "title": "🔀 Creando Documentos de Múltiples Páginas",
          "description": "La herramienta de Texto a Manuscrito te permite construir documentos de múltiples páginas:",
          "addPages": {
            "title": "Agregar Páginas a Tu Libro",
            "description": "Da formato a tu texto, haz clic en 'Agregar al Libro', luego crea nuevas páginas modificando el texto y repitiendo el proceso."
          },
          "managingBook": {
            "title": "Gestionando Tu Libro",
            "description": "Todas las páginas agregadas a tu libro aparecerán en el área del libro en la parte inferior de la pantalla."
          }
        },
        "downloading": {
          "title": "📥 Descargando Tu Contenido",
          "singlePage": {
            "title": "Descarga de Página Individual",
            "description": "Usa el botón 'Descargar como Imagen' para guardar la página actual como un archivo de imagen."
          },
          "multiPage": {
            "title": "Opciones de Descarga de Múltiples Páginas",
            "description": "Después de agregar páginas a tu libro, usa 'Descargar como PDF' para compilar todas las páginas en un solo documento o 'Descargar Todas las Imágenes' para archivos individuales."
          }
        },
        "tips": {
          "title": "💡 Consejos Profesionales",
          "tip1": "Si las líneas o el texto se superponen, ajusta la configuración de espaciado para mejorar la legibilidad.",
          "tip2": "Para un formato consistente en múltiples páginas, toma nota de tu configuración antes de agregar cada nueva página.",
          "tip3": "La función 'Agregar al Libro' es esencial para crear documentos de múltiples páginas que puedes descargar juntos como un PDF.",
          "tip4": "Experimenta con diferentes fuentes de escritura a mano para encontrar el estilo que mejor se adapte a tus necesidades.",
          "tip5": "Usa el panel de vista previa para ver cómo tus configuraciones afectan la apariencia final antes de descargar."
        },
        "troubleshooting": {
          "title": "🛠️ ¿Tienes Problemas?",
          "layout": {
            "title": "Problemas de Diseño de Página",
            "description": "Si el texto aparece cortado o superpuesto, intenta reducir el tamaño de fuente, aumentar el espaciado de líneas o ajustar la configuración de márgenes."
          },
          "download": {
            "title": "Problemas de Descarga",
            "description": "Asegúrate de hacer clic en 'Agregar al Libro' para cada página que quieras incluir en tu PDF y verifica que todas las páginas estén agregadas antes de descargar."
          },
          "rendering": {
            "title": "Renderizado de Texto",
            "description": "Si la escritura a mano aparece inconsistente, intenta ajustar el espaciado de letras y palabras, y asegúrate de que tu texto no contenga caracteres especiales no compatibles."
          }
        }
      }
    },
    "characterCounter": {
      "title": "Herramienta de Contador de Caracteres",
      "label": "Contador de Caracteres",
      "navDescription": "Cuenta caracteres y palabras en tu texto sin esfuerzo.",
      "subLabel": "Suite de Contador de Caracteres",
      "subNavDescription": "Cuenta fácilmente caracteres y palabras en tu texto.",
      "description": "Usa nuestra Herramienta de Contador de Caracteres para contar rápidamente el número de caracteres y palabras en tu texto.",
      "keywords": {
        "0": "Contador de Caracteres",
        "1": "Conteo de Caracteres",
        "2": "Contador de Caracteres en Línea",
        "3": "Análisis de Caracteres",
        "4": "Verificador de Caracteres",
        "5": "Estadísticas de Caracteres",
        "6": "Herramienta de Caracteres",
        "7": "Agregador de Caracteres",
        "8": "Composición de Caracteres"
      },
      "page": {
        "title": "Contador de Caracteres",
        "description": "Cuenta caracteres y palabras en tu texto sin esfuerzo."
      },
      "input": {
        "label": "Introduce tu texto",
        "placeholder": "Escribe o pega tu texto aquí..."
      },
      "processedText": {
        "title": "Vista Previa del Texto Procesado",
        "empty": "No hay texto después de aplicar filtros"
      },
      "countDisplay": {
        "title": "Conteo de Caracteres",
        "increasing": "aumentando",
        "decreasing": "disminuyendo"
      },
      "options": {
        "counting": {
          "title": "Opciones de Conteo",
          "stopAt": {
            "label": "Detener conteo en",
            "placeholder": "Introduce letra o palabra",
            "help": "Cuenta solo hasta esta letra o palabra"
          },
          "ignoreChars": {
            "label": "Ignorar caracteres específicos",
            "placeholder": "ej. abc",
            "help": "Caracteres a excluir del conteo"
          },
          "trim": "Recortar espacios en blanco antes de contar"
        },
        "ignore": {
          "title": "Opciones de Ignorar",
          "numbers": "Ignorar números",
          "symbols": "Ignorar símbolos",
          "uppercase": "Ignorar letras mayúsculas",
          "lowercase": "Ignorar letras minúsculas",
          "whitespace": "Ignorar espacios en blanco"
        }
      },
      "docs": {
        "title": "🔢 Cómo Usar la Herramienta de Contador de Caracteres",
        "intro": "Cuenta y analiza texto fácilmente con filtros y opciones personalizables.",
        "whatIs": {
          "title": "✨ ¿Qué es la Herramienta de Contador de Caracteres?",
          "description": "La herramienta de Contador de Caracteres es una utilidad poderosa que te permite contar caracteres en tu texto con precisión. Ya sea que necesites contar para publicaciones en redes sociales, contenido SEO o tareas de programación, esta herramienta te ayuda a analizar texto con filtros personalizables y opciones de formato."
        },
        "features": {
          "title": "📦 Características Clave",
          "realTimeCount": {
            "title": "Conteo de Caracteres en Tiempo Real",
            "description": "Ve cómo tu conteo de caracteres se actualiza instantáneamente mientras escribes o editas tu texto."
          },
          "filterOptions": {
            "title": "Filtros Personalizables",
            "description": "Filtra caracteres específicos, números, símbolos o espacios en blanco de tu conteo."
          },
          "stopAt": {
            "title": "Análisis Parcial de Texto",
            "description": "Cuenta caracteres hasta un carácter o palabra específica en tu texto."
          },
          "caseOptions": {
            "title": "Opciones de Sensibilidad de Mayúsculas",
            "description": "Incluye o excluye letras mayúsculas o minúsculas de tu conteo."
          },
          "trimWhitespace": {
            "title": "Gestión de Espacios en Blanco",
            "description": "Opcionalmente recorta espacios en blanco al inicio y al final antes de contar."
          }
        },
        "steps": {
          "title": "🚀 Cómo Usar el Contador de Caracteres",
          "step1": {
            "title": "Paso 1: Introduce Tu Texto",
            "description": "Escribe o pega tu texto en el campo de entrada. El conteo de caracteres se actualizará automáticamente a medida que realices cambios."
          },
          "step2": {
            "title": "Paso 2: Ve Tu Conteo de Caracteres",
            "description": "El número de caracteres en tu texto se muestra de manera prominente en el contador. El conteo se actualiza en tiempo real mientras editas tu texto."
          },
          "step3": {
            "title": "Paso 3: Aplica Filtros (Opcional)",
            "description": "Usa las opciones de filtro para personalizar lo que se cuenta. Puedes excluir caracteres específicos, números, símbolos o espacios en blanco."
          },
          "step4": {
            "title": "Paso 4: Establece Límites de Conteo (Opcional)",
            "description": "Si solo deseas contar hasta un cierto punto en tu texto, introduce un carácter o palabra en el campo 'Detener conteo en'."
          },
          "step5": {
            "title": "Paso 5: Vista Previa y Copia Resultados",
            "description": "Ve tu texto procesado y el conteo final de caracteres. Puedes copiar el conteo a tu portapapeles si es necesario."
          }
        },
        "countingOptions": {
          "title": "⚙️ Opciones de Conteo",
          "stopAt": {
            "title": "Detener Conteo En",
            "description": "Limita el conteo para incluir solo caracteres hasta un carácter o palabra específica. Útil para verificar si el texto se ajusta a límites específicos."
          },
          "ignoreChars": {
            "title": "Ignorar Caracteres Específicos",
            "description": "Excluye caracteres específicos del conteo. Introduce los caracteres que deseas ignorar sin separadores."
          },
          "trimText": {
            "title": "Recortar Espacios en Blanco",
            "description": "Elimina espacios en blanco al inicio y al final antes de contar. Útil para conteos más precisos cuando no se deben incluir espacios en blanco."
          }
        },
        "ignoreOptions": {
          "title": "🚫 Opciones de Ignorar",
          "numbers": {
            "title": "Ignorar Números",
            "description": "Excluye todos los dígitos numéricos (0-9) del conteo de caracteres."
          },
          "symbols": {
            "title": "Ignorar Símbolos",
            "description": "Excluye todos los caracteres especiales y símbolos del conteo, enfocándose solo en caracteres alfanuméricos."
          },
          "uppercase": {
            "title": "Ignorar Letras Mayúsculas",
            "description": "Excluye todas las letras mayúsculas del conteo. Útil cuando solo deseas contar contenido en minúsculas."
          },
          "lowercase": {
            "title": "Ignorar Letras Minúsculas",
            "description": "Excluye todas las letras minúsculas del conteo. Útil cuando solo deseas contar contenido en mayúsculas."
          },
          "whitespace": {
            "title": "Ignorar Espacios en Blanco",
            "description": "Excluye todos los espacios, tabulaciones y saltos de línea del conteo. Proporciona un conteo solo de caracteres visibles."
          }
        },
        "preview": {
          "title": "👁️ Vista Previa del Texto Procesado",
          "description": "Muestra tu texto después de que se hayan aplicado todos los filtros. Este es el texto exacto que se está utilizando para el conteo de caracteres."
        },
        "tips": {
          "title": "💡 Consejos Profesionales",
          "tip1": "Usa 'Ignorar Espacios en Blanco' al contar caracteres para codificación o cuando los espacios no deben contar hacia tu total.",
          "tip2": "La función 'Detener conteo en' es perfecta para verificar si tu texto se ajustará a los límites de caracteres para plataformas de redes sociales.",
          "tip3": "Para la optimización de etiquetas de título SEO, usa el contador sin filtros para mantenerte dentro de los límites de caracteres recomendados.",
          "tip4": "Al contar palabras que contienen formato especial, usa las opciones de ignorar para contar solo los caracteres que te importan.",
          "tip5": "La vista previa del texto procesado te ayuda a entender exactamente qué se está contando después de que se aplican todos tus filtros."
        },
        "troubleshooting": {
          "title": "🛠️ ¿Tienes Problemas?",
          "unexpectedCount": {
            "title": "Conteo de Caracteres Inesperado",
            "description": "Si tu conteo parece incorrecto, verifica si hay filtros habilitados. La vista previa del texto procesado muestra exactamente qué se está contando."
          },
          "filterInteraction": {
            "title": "Conflictos de Filtros",
            "description": "Habilitar demasiados filtros puede resultar en muy poco texto para contar. Usa la vista previa del texto procesado para ver qué queda después de filtrar."
          },
          "performanceIssues": {
            "title": "Rendimiento con Texto Grande",
            "description": "Para texto muy grande, el contador puede tardar un momento en actualizarse. Ten paciencia o intenta dividir tu texto en secciones más pequeñas."
          }
        }
      }
    },
    "wordCounter": {
      "title": "Herramienta de Contador de Palabras",
      "label": "Contador de Palabras",
      "navDescription": "Cuenta palabras en tu texto sin esfuerzo.",
      "subLabel": "Suite de Contador de Palabras",
      "subNavDescription": "Cuenta palabras en tu texto fácilmente con filtros personalizados.",
      "description": "Usa nuestra Herramienta de Contador de Palabras para contar rápidamente el número de palabras en tu texto.",
      "keywords": {
        "0": "Contador de Palabras",
        "1": "Conteo de Palabras",
        "2": "Contador de Palabras en Línea",
        "3": "Análisis de Palabras",
        "4": "Verificador de Palabras",
        "5": "Estadísticas de Palabras",
        "6": "Herramienta de Palabras",
        "7": "Frecuencia de Palabras",
        "8": "Calculadora de Palabras"
      },
      "page": {
        "title": "Contador de Palabras",
        "description": "Cuenta palabras en tu texto con filtros y opciones personalizables."
      },
      "input": {
        "label": "Introduce tu texto",
        "placeholder": "Escribe o pega tu texto aquí..."
      },
      "processedText": {
        "title": "Vista Previa del Texto Procesado",
        "empty": "No hay texto después de aplicar filtros"
      },
      "countDisplay": {
        "title": "Conteo de Palabras",
        "increasing": "aumentando",
        "decreasing": "disminuyendo",
        "char": "Conteo de Caracteres"
      },
      "options": {
        "dialog": {
          "edit": "Editar lista de palabras comunes",
          "title": "Editar Palabras Comunes",
          "save": "Guardar Cambios",
          "description": "Introduce palabras comunes separadas por comas que deseas excluir de tu conteo de palabras."
        },
        "counting": {
          "title": "Opciones de Conteo",
          "stopAtWord": {
            "label": "Dejar de contar en",
            "placeholder": "Introduce palabra",
            "help": "Cuenta solo hasta esta palabra"
          },
          "minWordLength": {
            "label": "Longitud mínima de palabra",
            "placeholder": "p.ej. 3",
            "help": "Cuenta solo palabras con este número de caracteres o más"
          },
          "maxWordLength": {
            "label": "Longitud máxima de palabra",
            "placeholder": "p.ej. 15",
            "help": "Cuenta solo palabras con este número de caracteres o menos"
          },
          "trim": "Recortar espacios en blanco antes de contar"
        },
        "wordTypes": {
          "title": "Tipos de Palabras",
          "ignoreCommonWords": "Ignorar palabras comunes (a, el, y, etc.)",
          "countNumbers": "Contar números como palabras",
          "countHyphenatedAsOne": "Contar palabras con guiones como una sola palabra",
          "countAbbreviations": "Contar abreviaturas como palabras"
        }
      },
      "docs": {
        "title": "📝 Cómo Usar la Herramienta de Contador de Palabras",
        "intro": "Cuenta y analiza palabras fácilmente con filtros y opciones personalizables.",
        "whatIs": {
          "title": "✨ ¿Qué es la Herramienta de Contador de Palabras?",
          "description": "La herramienta de Contador de Palabras es una utilidad poderosa que te permite contar palabras en tu texto con precisión. Ya sea que necesites verificar conteos de palabras para ensayos, artículos, publicaciones en redes sociales o contenido SEO, esta herramienta te ayuda a analizar texto con filtros personalizables y opciones específicas de palabras."
        },
        "features": {
          "title": "📦 Características Clave",
          "realTimeCount": {
            "title": "Conteo de Palabras en Tiempo Real",
            "description": "Ve cómo tu conteo de palabras se actualiza instantáneamente mientras escribes o editas tu texto."
          },
          "filterOptions": {
            "title": "Filtros Personalizables",
            "description": "Filtra tu conteo basado en tipos de palabras, palabras comunes y otros criterios."
          },
          "wordLength": {
            "title": "Control de Longitud de Palabra",
            "description": "Cuenta solo palabras que cumplan con requisitos de longitud específicos."
          },
          "wordTypes": {
            "title": "Filtrado de Tipos de Palabras",
            "description": "Elige qué tipos de palabras incluir en tu conteo, como números, abreviaturas y palabras con guiones."
          },
          "trimWhitespace": {
            "title": "Gestión de Espacios en Blanco",
            "description": "Opcionalmente recorta espacios en blanco al inicio y al final antes de contar."
          }
        },
        "steps": {
          "title": "🚀 Cómo Usar el Contador de Palabras",
          "step1": {
            "title": "Paso 1: Introduce Tu Texto",
            "description": "Escribe o pega tu texto en el campo de entrada. El conteo de palabras se actualizará automáticamente a medida que realices cambios."
          },
          "step2": {
            "title": "Paso 2: Ve Tu Conteo de Palabras",
            "description": "El número de palabras en tu texto se muestra de manera prominente en el contador. El conteo se actualiza en tiempo real mientras editas tu texto."
          },
          "step3": {
            "title": "Paso 3: Aplica Filtros (Opcional)",
            "description": "Usa las opciones de filtro para personalizar lo que se cuenta. Puedes excluir palabras comunes, establecer requisitos de longitud de palabra y filtrar por tipos de palabras."
          },
          "step4": {
            "title": "Paso 4: Establece Límites de Conteo (Opcional)",
            "description": "Si solo deseas contar hasta un cierto punto en tu texto, introduce una palabra en el campo 'Dejar de contar en'."
          },
          "step5": {
            "title": "Paso 5: Vista Previa y Copia Resultados",
            "description": "Ve tu texto procesado y el conteo final de palabras. Puedes copiar el conteo a tu portapapeles si es necesario."
          }
        },
        "countingOptions": {
          "title": "⚙️ Opciones de Conteo",
          "stopAtWord": {
            "title": "Dejar de Contar en",
            "description": "Limita el conteo para incluir solo palabras hasta una palabra específica. Útil para verificar si el texto se ajusta a límites de palabras específicos o para analizar secciones de textos más largos."
          },
          "minWordLength": {
            "title": "Longitud Mínima de Palabra",
            "description": "Cuenta solo palabras que tengan al menos este número de caracteres. Útil para excluir palabras muy cortas como 'a', 'un', 'el', etc."
          },
          "maxWordLength": {
            "title": "Longitud Máxima de Palabra",
            "description": "Cuenta solo palabras que tengan como máximo este número de caracteres. Útil para excluir palabras muy largas o posibles errores en tu texto."
          },
          "trimText": {
            "title": "Recortar Espacios en Blanco",
            "description": "Elimina espacios en blanco al inicio y al final antes de contar. Útil para conteos más precisos cuando los espacios en blanco no deben afectar tu conteo de palabras."
          }
        },
        "wordTypes": {
          "title": "🔤 Tipos de Palabras",
          "ignoreCommonWords": {
            "title": "Ignorar Palabras Comunes",
            "description": "Excluye palabras comunes como 'el', 'un', 'una', 'y', etc. del conteo. Útil para centrarse en las palabras de contenido más significativas."
          },
          "countNumbers": {
            "title": "Contar Números",
            "description": "Cuando está habilitado, trata las cadenas numéricas (como '42' o '2025') como palabras. Cuando está deshabilitado, los números no se incluirán en el conteo de palabras."
          },
          "countHyphenatedAsOne": {
            "title": "Contar Palabras con Guiones como Una",
            "description": "Cuando está habilitado, trata los términos con guiones (como 'de-última-generación') como una sola palabra. Cuando está deshabilitado, cada parte se cuenta por separado."
          },
          "countAbbreviations": {
            "title": "Contar Abreviaturas",
            "description": "Cuando está habilitado, incluye abreviaturas y acrónimos (como 'EE.UU.' o 'NASA') en el conteo de palabras. Cuando está deshabilitado, se excluyen."
          }
        },
        "preview": {
          "title": "👁️ Vista Previa del Texto Procesado",
          "description": "Muestra tu texto después de que se hayan aplicado todos los filtros. Este es el texto exacto que se está utilizando para el conteo de palabras."
        },
        "tips": {
          "title": "💡 Consejos Profesionales",
          "tip1": "Usa 'Longitud Mínima de Palabra' para centrarte en palabras de contenido más significativas y filtrar artículos cortos y preposiciones.",
          "tip2": "La función 'Dejar de contar en' es perfecta para verificar si tu introducción se ajusta a un límite de palabras específico.",
          "tip3": "Para escritura académica, habilita 'Contar Palabras con Guiones como Una' para coincidir con las reglas de conteo de palabras de la mayoría de las guías de estilo.",
          "tip4": "Usa 'Ignorar Palabras Comunes' cuando desees analizar la densidad de términos clave en tu contenido.",
          "tip5": "La vista previa del texto procesado te ayuda a entender exactamente qué se está contando después de aplicar todos tus filtros."
        },
        "troubleshooting": {
          "title": "🛠️ ¿Tienes Problemas?",
          "unexpectedCount": {
            "title": "Conteo de Palabras Inesperado",
            "description": "Si tu conteo parece incorrecto, verifica si hay filtros habilitados. La vista previa del texto procesado muestra exactamente qué se está contando."
          },
          "filterInteraction": {
            "title": "Conflictos de Filtros",
            "description": "Usar múltiples filtros juntos podría reducir significativamente tu conteo de palabras. Por ejemplo, establecer una longitud mínima de palabra alta mientras se ignoran palabras comunes podría filtrar una gran parte de tu texto."
          },
          "performanceIssues": {
            "title": "Rendimiento con Texto Grande",
            "description": "Para documentos muy grandes, el contador puede tardar un momento en actualizarse. Ten paciencia o intenta dividir tu texto en secciones más pequeñas."
          }
        }
      }
    },
    "instagramPostGenerator": {
      "title": "Herramienta Generadora de Publicaciones de Instagram",
      "label": "Generador de Publicaciones de Instagram",
      "navDescription": "Crea maquetas realistas de publicaciones de Instagram rápida y fácilmente.",
      "subLabel": "Suite de Publicaciones de Instagram",
      "subNavDescription": "Diseña y personaliza maquetas de publicaciones de Instagram para tus proyectos.",
      "description": "Usa nuestra Herramienta Generadora de Publicaciones de Instagram para crear maquetas personalizables de publicaciones de Instagram.",
      "keywords": {
        "0": "Generador de Publicaciones de Instagram",
        "1": "Maqueta de Instagram",
        "2": "Plantilla de Redes Sociales",
        "3": "Creador de Publicaciones de Instagram",
        "4": "Diseñador de Instagram",
        "5": "Maqueta de Redes Sociales",
        "6": "UI de Instagram",
        "7": "Generador de Publicaciones",
        "8": "Creador de Contenido de Redes Sociales"
      },
      "page": {
        "title": "Generador de Publicaciones de Instagram",
        "description": "Crea maquetas personalizables de publicaciones de Instagram para tus proyectos"
      },
      "userInfo": {
        "username": {
          "label": "Nombre de Usuario",
          "placeholder": "Introduce el nombre de usuario"
        },
        "avatar": {
          "label": "Foto de Perfil",
          "button": "Subir Avatar"
        },
        "verified": {
          "label": "Cuenta Verificada"
        },
        "location": {
          "label": "Ubicación",
          "placeholder": "Introduce la ubicación"
        }
      },
      "postContent": {
        "caption": {
          "label": "Subtítulo",
          "placeholder": "Escribe el subtítulo de tu publicación..."
        },
        "timeAgo": {
          "label": "Hora de Publicación",
          "placeholder": "p. ej. HACE 2 HORAS"
        },
        "image": {
          "label": "Imagen de la Publicación",
          "button": "Subir Imagen"
        }
      },
      "appearance": {
        "theme": {
          "label": "Tema de la Publicación",
          "light": "Claro",
          "dark": "Oscuro"
        },
        "viewMode": {
          "label": "Modo de Vista",
          "web": "Versión Web",
          "mobile": "Versión Móvil"
        }
      },
      "engagement": {
        "likes": {
          "label": "Me gusta",
          "placeholder": "Número de me gusta"
        },
        "liked": {
          "label": "Te gusta"
        },
        "comments": {
          "label": "Comentarios",
          "placeholder": "Número de comentarios",
          "label2": "Comentarios Destacados",
          "addPlaceholder": "Añadir un comentario...",
          "usernamePlaceholder": "Nombre de usuario",
          "addButton": "Añadir",
          "viewAll": "Ver todos los {count} comentarios"
        }
      },
      "actions": {
        "download": "Descargar Imagen de la Publicación",
        "removeComment": "Eliminar comentario"
      },
      "postElements": {
        "likes": "{count} me gusta"
      },
      "docs": {
        "title": "📱 Cómo Usar la Herramienta Generadora de Publicaciones de Instagram",
        "intro": "Crea maquetas personalizables de publicaciones de Instagram con nuestro generador fácil de usar.",
        "usagePolicy": {
          "title": "Política de Uso Importante",
          "intro": "Antes de usar la Herramienta Generadora de Publicaciones de Instagram, por favor lee y comprende las siguientes pautas:",
          "disclaimer": "Rivine Tools no se hace responsable del contenido creado con este generador. Al usar esta herramienta, aceptas:",
          "rules": {
            "rule1": "No crear contenido que pueda dañar, acosar, desprestigiar o intimidar a individuos u organizaciones",
            "rule2": "No usar imágenes generadas para difundir información errónea que pueda impactar negativamente a otros",
            "rule3": "No presentar publicaciones generadas como contenido auténtico de Instagram o publicaciones reales de cuentas reales",
            "rule4": "Indicar claramente a los espectadores que cualquier contenido creado con esta herramienta es generado y no genuino",
            "rule5": "No hacerse pasar por individuos u organizaciones reales con intención maliciosa",
            "rule6": "No usar la herramienta para crear contenido que viole leyes o políticas de plataformas",
            "rule7": "Usar la herramienta de manera responsable y ética para propósitos legítimos como maquetas, educación o diseño"
          },
          "conclusion": "Esta herramienta está destinada solo para propósitos creativos, educativos y de diseño. Por favor úsala responsablemente."
        },
        "whatIs": {
          "title": "✨ ¿Qué es la Herramienta Generadora de Publicaciones de Instagram?",
          "description": "El Generador de Publicaciones de Instagram es una herramienta de diseño que crea maquetas realistas de publicaciones de Instagram. Es perfecta para creadores de contenido, diseñadores, mercadólogos o cualquiera que necesite visualizar cómo podría aparecer el contenido en Instagram antes de publicarlo."
        },
        "features": {
          "title": "📦 Características Clave",
          "customization": {
            "title": "Personalización Completa de Publicaciones",
            "description": "Controla cada aspecto de tu publicación de Instagram desde el nombre de usuario y la foto de perfil hasta los subtítulos y comentarios."
          },
          "themes": {
            "title": "Temas Claro y Oscuro",
            "description": "Cambia entre los modos claro y oscuro de Instagram para coincidir con tu estética preferida."
          },
          "viewModes": {
            "title": "Múltiples Modos de Vista",
            "description": "Ve tu publicación en diseños web y móvil para ver cómo aparecería en diferentes dispositivos."
          },
          "download": {
            "title": "Descarga de Imagen",
            "description": "Descarga tu publicación creada como una imagen de alta calidad para usar en presentaciones, maquetas o diseños."
          },
          "engagement": {
            "title": "Personalización de Interacción",
            "description": "Ajusta los me gusta y comentarios para visualizar diferentes niveles de interacción en tu contenido."
          }
        },
        "steps": {
          "title": "🚀 Cómo Usar el Generador de Publicaciones de Instagram",
          "step1": {
            "title": "Paso 1: Configura los Detalles del Usuario",
            "description": "Introduce un nombre de usuario, sube una foto de perfil, añade una ubicación y elige si la cuenta está verificada."
          },
          "step2": {
            "title": "Paso 2: Añade Contenido a la Publicación",
            "description": "Sube tu imagen de publicación y escribe un subtítulo. Establece la marca de tiempo de la publicación para indicar cuándo se publicó."
          },
          "step3": {
            "title": "Paso 3: Selecciona Opciones de Apariencia",
            "description": "Elige entre temas claro y oscuro, y selecciona el modo de vista web o móvil para satisfacer tus necesidades."
          },
          "step4": {
            "title": "Paso 4: Añade Interacción",
            "description": "Establece el número de me gusta para tu publicación y añade comentarios para hacer tu maqueta más realista."
          },
          "step5": {
            "title": "Paso 5: Genera y Descarga",
            "description": "Una vez que estés satisfecho con tu diseño, descarga la imagen para usarla en tus proyectos."
          }
        },
        "customizationOptions": {
          "title": "⚙️ Opciones de Personalización",
          "profileSection": {
            "title": "Opciones de Perfil",
            "description": "Personaliza el perfil del usuario con nombre de usuario, foto de perfil, insignia de verificación y etiqueta de ubicación personalizados."
          },
          "contentSection": {
            "title": "Opciones de Contenido",
            "description": "Sube tu propia imagen para la publicación y crea un subtítulo personalizado para expresar tu mensaje."
          },
          "appearanceSection": {
            "title": "Opciones de Apariencia",
            "description": "Cambia entre temas claro y oscuro, y cambia entre modos de vista web y móvil para diferentes pantallas."
          },
          "engagementSection": {
            "title": "Opciones de Interacción",
            "description": "Personaliza los conteos de me gusta y añade comentarios para simular una interacción realista del usuario en tu publicación."
          }
        },
        "tips": {
          "title": "💡 Consejos Profesionales",
          "tip1": "Usa imágenes cuadradas (relación 1:1) para obtener los mejores resultados, ya que Instagram muestra las publicaciones en este formato.",
          "tip2": "Para maquetas más realistas, usa nombres de usuario que reflejen tu audiencia objetivo o identidad de marca.",
          "tip3": "Al crear maquetas para clientes, usa sus colores de marca y estética en el diseño de tu publicación.",
          "tip4": "Añade etiquetas de ubicación para aumentar la autenticidad de tu maqueta, especialmente para contenido de viajes o negocios locales.",
          "tip5": "Usa el tema oscuro para un aspecto más moderno o para coincidir con la estética de tu presentación."
        },
        "troubleshooting": {
          "title": "🛠️ ¿Tienes Problemas?",
          "imageIssues": {
            "title": "La Imagen No Se Muestra Correctamente",
            "description": "Intenta usar imágenes cuadradas para una visualización óptima. Si las imágenes aparecen estiradas o comprimidas, ajústalas a una relación de aspecto 1:1 antes de subirlas."
          },
          "downloadProblems": {
            "title": "Problemas de Descarga",
            "description": "Si el botón de descarga no funciona, prueba con otro navegador o asegúrate de haber permitido los permisos necesarios para descargas de imágenes."
          },
          "performanceIssues": {
            "title": "Rendimiento con Imágenes Grandes",
            "description": "Para imágenes muy grandes, la herramienta puede ralentizarse. Intenta usar imágenes optimizadas de menos de 2MB para obtener el mejor rendimiento."
          }
        }
      }
    }
  }
}