{
  "home": {
    "label": "Uma crescente suíte de ferramentas rápidas e confiáveis",
    "subLabel": "Construído para simplicidade e desempenho. Novas ferramentas são adicionadas regularmente para ajudar os usuários a se manterem produtivos e realizarem tarefas—sem distrações ou desordem",
    "title": "Ferramentas online gratuitas",
    "description": "Descubra ferramentas online rápidas e gratuitas para tarefas diárias. Rivine Tools oferece utilitários web focados na privacidade.",
    "exploreTools": "Explorar Ferramentas",
    "keywords": {
      "0": "Ferramentas online",
      "1": "Ferramentas web",
      "2": "Editor de Imagens",
      "3": "Editor de Texto",
      "4": "Ferramentas do Instagram",
      "5": "Ferramentas do Facebook",
      "6": "Coleção de ferramentas"
    },
    "docs": {
      "valueSection": {
        "title": "🛠️ Ferramentas Poderosas para Tarefas Diárias",
        "description": "Nossa coleção de ferramentas online gratuitas ajuda você a resolver desafios digitais diários sem instalar software adicional. Simples, eficazes e prontas quando você precisa delas."
      },
      "benefitsSection": {
        "title": "Por Que Usar Nossas Ferramentas?",
        "benefits": [
          {
            "title": "Não Requer Instalação",
            "description": "Todas as ferramentas funcionam diretamente no seu navegador - sem downloads, sem instalações, sem complicações."
          },
          {
            "title": "Focadas na Privacidade",
            "description": "Seus dados permanecem no seu dispositivo. Não armazenamos seus arquivos ou informações em nossos servidores."
          },
          {
            "title": "Grátis para Usar",
            "description": "Todas as ferramentas são completamente gratuitas, sem custos ocultos ou recursos premium."
          },
          {
            "title": "Continuamente Melhoradas",
            "description": "Atualizamos regularmente nossas ferramentas com base no feedback dos usuários e nos avanços tecnológicos."
          }
        ]
      },
      "categoriesSection": {
        "title": "Ferramentas para Cada Necessidade",
        "categories": [
          {
            "title": "Ferramentas de Texto e Documentos",
            "description": "Compare textos, converta formatos e transforme conteúdo escrito com facilidade."
          },
          {
            "title": "Utilitários de Imagem",
            "description": "Edite, converta e combine imagens sem software complexo."
          },
          {
            "title": "Ferramentas de Dados e Conversão",
            "description": "Transforme formatos de dados, converta unidades e simplifique tarefas técnicas."
          },
          {
            "title": "Assistentes Criativos",
            "description": "Gere conteúdo criativo e visualize ideias com ferramentas intuitivas."
          }
        ]
      },
      "usageSection": {
        "title": "Como Começar",
        "steps": "Basta navegar pela nossa coleção acima, selecionar a ferramenta que você precisa e seguir as instruções fáceis na página de cada ferramenta. Não é necessário criar uma conta - basta abrir e usar imediatamente."
      },
      "empowerSection": {
        "title": "Empodere Seu Fluxo de Trabalho",
        "steps": "Ferramentas online simplificam tarefas complexas, permitindo que você permaneça produtivo onde quer que esteja. Seja você um estudante, desenvolvedor, designer ou apenas precise de uma solução rápida, tudo o que você precisa está a um clique de distância."
      }
    }
  },
  "general": {
    "download": "Baixar",
    "about": "Sobre",
    "home": "Início",
    "cancel": "Cancelar",
    "save": "Salvar",
    "upload": "Carregar",
    "clear": "Limpar"
  },
  "tools": {
    "qrCodeGenerator": {
      "title": "Gerador de QR Code Gratuito",
      "label": "Gerador de QR Code",
      "navDescription": "Crie códigos QR para URLs, texto, números de telefone e mais.",
      "subLabel": "Suite de Gerador de QR Code",
      "subNavDescription": "Gere todos os tipos de códigos QR em um só lugar.",
      "description": "Gere códigos QR instantaneamente com nosso gerador de QR Code online gratuito. Personalize com cores, logotipos e downloads de alta qualidade.",
      "keywords": {
        "0": "Gerador de QR Code",
        "1": "Criador de QR Code Gratuito",
        "2": "QR Code Personalizado",
        "3": "Criar QR Code",
        "4": "Gerar QR Code",
        "5": "QR Code de Texto",
        "6": "Gerar QR Code Online"
      },
      "autoGenerationMessage": "Seu QR Code será gerado automaticamente",
      "url": {
        "label": "URL",
        "navDescription": "Gere códigos QR para links.",
        "title": "Gerador de QR Code Gratuito | Gere Códigos QR Personalizados Online",
        "description": "Gere e personalize facilmente códigos QR para URLs. Ideal para compartilhar conteúdo online, direcionar tráfego ou aprimorar materiais impressos. Rápido, gratuito e sem necessidade de cadastro.",
        "input": "Insira o URL do seu site aqui"
      },
      "text": {
        "label": "Texto",
        "navDescription": "Codifique texto simples em códigos QR.",
        "title": "Gerador de QR Code Gratuito para Texto | Crie Códigos QR de Texto Personalizados",
        "description": "Gere e personalize facilmente códigos QR para mensagens de texto. Perfeito para compartilhar informações de forma rápida e eficiente. Rápido, gratuito e sem necessidade de cadastro.",
        "input": "Insira sua mensagem de texto aqui"
      },
      "phone": {
        "label": "Telefone",
        "navDescription": "Gere códigos QR para discar um número.",
        "title": "Gerador de QR Code Gratuito para Números de Telefone | Crie Códigos QR de Telefone Personalizados",
        "description": "Gere e personalize facilmente códigos QR para números de telefone. Ideal para compartilhar informações de contato instantaneamente. Rápido, gratuito e sem necessidade de cadastro.",
        "input": "Insira seu número de telefone aqui"
      },
      "docs": {
        "title": "🧾 Como Usar o Gerador de Código QR Rivine",
        "intro": "Gere um código QR em segundos! Quer você esteja vinculando a um site, compartilhando uma nota rápida ou incorporando um número de telefone — tudo está a apenas alguns cliques de distância.",
        "whatIs": {
          "title": "✨ O que é um Código QR?",
          "description": "Um código QR (Resposta Rápida) é um tipo de código de barras que contém informações como links, texto ou detalhes de contato. Ele pode ser escaneado usando a câmera do seu telefone ou um leitor de código QR para acessar instantaneamente o conteúdo."
        },
        "whatCanYouCreate": {
          "title": "📦 O que Você Pode Criar?",
          "url": {
            "title": "URL:",
            "description": "Link para sites, portfólios ou aplicativos."
          },
          "text": {
            "title": "Texto:",
            "description": "Exibir mensagens, notas ou códigos."
          },
          "phone": {
            "title": "Telefone:",
            "description": "Incorpore um número para que os usuários possam tocar e ligar."
          }
        },
        "steps": {
          "title": "🚀 Como Gerar um Código QR",
          "step1": {
            "title": "Passo 1: Escolha o que Você Quer Codificar",
            "description": "Use o menu à esquerda para selecionar URL, Texto ou Telefone."
          },
          "step2": {
            "title": "Passo 2: Digite seu Conteúdo",
            "description": "Digite seu conteúdo no campo de entrada. O código QR é atualizado instantaneamente!"
          },
          "step3": {
            "title": "Passo 3: Visualize seu Código QR",
            "description": "Você verá o código aparecer à direita — pronto para escanear."
          },
          "step4": {
            "title": "Passo 4: Escolha o Formato do Arquivo",
            "description": "Escolha PNG ou SVG dependendo de como você vai usá-lo."
          },
          "step5": {
            "title": "Passo 5: Baixar",
            "description": "Clique no botão e pronto!"
          },
          "exampleLabel": "Exemplo (URL):",
          "downloadButton": "Baixar"
        },
        "tips": {
          "title": "💡 Dicas Profissionais",
          "tip1": "Para impressão, use SVG para evitar bordas borradas.",
          "tip2": "Deixe algum espaço em branco ao redor do código QR para melhor escaneamento.",
          "tip3": "Certifique-se de que seu conteúdo está correto antes de compartilhar.",
          "tip4": "Teste com a câmera do seu telefone antes de publicá-lo em qualquer lugar."
        },
        "troubleshooting": {
          "title": "🛠️ Está com Problemas?",
          "qrNotShowing": {
            "title": "Código QR não está aparecendo?",
            "description": "Verifique se você digitou algo válido e selecionou a guia correta."
          },
          "downloadNotWorking": {
            "title": "Download não está funcionando?",
            "description": "Tente outro formato ou atualize a página."
          }
        }
      }
    },
    "clock": {
      "title": "Relógio",
      "label": "Relógio",
      "navDescription": "Defina temporizadores para uma variedade de tarefas e atividades.",
      "subLabel": "Suite de Relógio",
      "subNavDescription": "Gerencie seu tempo de forma eficiente com nosso temporizador online abrangente.",
      "description": "Temporizador online: tarefas, exercícios. Personalize alertas e durações conforme suas necessidades."
    },
    "timer": {
      "title": "Temporizador Online",
      "label": "Temporizador",
      "navDescription": "Defina temporizadores para várias tarefas e atividades.",
      "subLabel": "Suite de Ferramentas de Temporizador",
      "subNavDescription": "Gerencie seu tempo de forma eficaz com nosso temporizador online.",
      "description": "Use nosso temporizador online gratuito para acompanhar o tempo de tarefas, exercícios e mais. Personalize alertas e durações.",
      "page": {
        "paused": "Pausado",
        "running": "Em execução"
      },
      "dialog": {
        "title": "Configurações do Temporizador",
        "presets": "Predefinições",
        "custom": "Duração Personalizada",
        "pomodoro": "Pomodoro",
        "short": "Pausa Curta",
        "focus": "Foco",
        "hours": "Horas",
        "min": "Minutos",
        "sec": "Segundos",
        "error": "Por favor, defina uma duração de tempo"
      },
      "keywords": {
        "0": "Temporizador Online",
        "1": "Temporizador Gratuito",
        "2": "Temporizador de Tarefas",
        "3": "Temporizador de Exercícios",
        "4": "Definir Temporizador",
        "5": "Temporizador de Contagem Regressiva",
        "6": "Temporizador Online"
      },
      "docs": {
        "title": "⏱️ Como Usar o Temporizador Rivine",
        "intro": "Mantenha-se produtivo e gerencie seu tempo de forma eficaz com nosso temporizador personalizável. Perfeito para a técnica Pomodoro, sessões de trabalho focadas e intervalos programados.",
        "whatIs": {
          "title": "✨ O que é a Ferramenta de Temporizador?",
          "description": "O Temporizador é uma ferramenta de gerenciamento de tempo simples, mas poderosa, que ajuda você a rastrear o tempo para várias atividades. Com durações personalizáveis e predefinições para técnicas populares como Pomodoro, ele é projetado para aumentar sua produtividade e ajudar a manter um equilíbrio saudável entre trabalho e descanso."
        },
        "features": {
          "title": "📦 Recursos Principais",
          "visualTimer": {
            "title": "Indicador de Progresso Visual",
            "description": "Um anel de progresso circular mostra seu tempo restante de relance."
          },
          "presets": {
            "title": "Predefinições de Produtividade",
            "description": "Acesso rápido a durações de temporizador comuns como Pomodoro (25 min), Intervalo Curto (5 min) e Foco (50 min)."
          },
          "custom": {
            "title": "Duração Personalizada",
            "description": "Defina horas, minutos e segundos precisos para suas necessidades específicas de temporização."
          },
          "controls": {
            "title": "Controles Intuitivos",
            "description": "Opções simples de reproduzir, pausar, redefinir e configurações para fácil gerenciamento do temporizador."
          }
        },
        "presets": {
          "title": "⚡ Compreendendo as Predefinições do Temporizador",
          "pomodoro": {
            "title": "Pomodoro (25 minutos)",
            "description": "Baseado na popular Técnica Pomodoro, este temporizador de 25 minutos é projetado para sessões de trabalho focadas, geralmente seguido por um intervalo curto."
          },
          "shortBreak": {
            "title": "Intervalo Curto (5 minutos)",
            "description": "Um intervalo rápido de 5 minutos para descansar sua mente entre sessões de trabalho. Perfeito após uma sessão Pomodoro."
          },
          "focus": {
            "title": "Foco (50 minutos)",
            "description": "Um período de foco estendido para um trabalho mais profundo que requer mais atenção sustentada."
          }
        },
        "steps": {
          "title": "🚀 Como Usar o Temporizador",
          "step1": {
            "title": "Passo 1: Escolha uma Duração do Temporizador",
            "description": "Selecione entre as opções predefinidas (Pomodoro, Intervalo Curto, Foco) ou defina uma duração personalizada."
          },
          "step2": {
            "title": "Passo 2: Inicie o Temporizador",
            "description": "Pressione o botão de reproduzir para iniciar a contagem regressiva. O círculo começará a se preencher para representar visualmente o tempo decorrido."
          },
          "step3": {
            "title": "Passo 3: Monitore Seu Progresso",
            "description": "Observe o temporizador contar regressivamente e o indicador visual mostrar seu tempo restante."
          },
          "step4": {
            "title": "Passo 4: Gerencie Seu Temporizador",
            "description": "Pause, retome ou redefina o temporizador conforme necessário usando os botões de controle."
          }
        },
        "controls": {
          "title": "🎮 Compreendendo os Controles do Temporizador",
          "play": {
            "title": "Botão de Reproduzir",
            "description": "Inicia ou retoma a contagem regressiva do temporizador."
          },
          "pause": {
            "title": "Botão de Pausa",
            "description": "Interrompe temporariamente o temporizador enquanto preserva o tempo restante."
          },
          "reset": {
            "title": "Botão de Redefinir",
            "description": "Retorna o temporizador à sua duração inicial."
          },
          "settings": {
            "title": "Botão de Configurações",
            "description": "Abre o painel de configurações do temporizador para selecionar predefinições ou definir durações personalizadas."
          }
        },
        "customTimer": {
          "title": "⚙️ Configurando um Temporizador Personalizado",
          "description": "Precisa de uma duração específica não coberta pelas predefinições? Siga estas etapas para criar um temporizador personalizado:",
          "step1": "Clique no ícone de configurações (engrenagem) para abrir Configurações do Temporizador.",
          "step2": "Em 'Duração Personalizada', defina suas horas, minutos e segundos desejados usando as entradas numéricas.",
          "step3": "Clique em 'Salvar' para confirmar sua duração personalizada e retornar à tela do temporizador."
        },
        "tips": {
          "title": "💡 Dicas Profissionais",
          "tip1": "Para produtividade ideal usando a Técnica Pomodoro, tente 25 minutos de trabalho focado seguido por um intervalo de 5 minutos, depois repita.",
          "tip2": "Após completar quatro sessões Pomodoro, faça um intervalo mais longo de 15-30 minutos para recarregar.",
          "tip3": "Minimize as distrações durante as sessões de trabalho cronometradas fechando aplicativos desnecessários e colocando seus dispositivos no modo 'Não Perturbe'."
        },
        "troubleshooting": {
          "title": "🛠️ Está com Problemas?",
          "timerNotStarting": {
            "title": "Temporizador Não Está Iniciando?",
            "description": "Certifique-se de ter definido uma duração maior que zero e clique no botão de reproduzir para iniciar a contagem regressiva."
          },
          "notification": {
            "title": "Não Consegue Ouvir a Conclusão do Temporizador?",
            "description": "Aumente o volume para ouvir quando o temporizador terminar."
          }
        }
      }
    },
    "utilities": {
      "title": "Utilitários",
      "label": "Utilitários",
      "navDescription": "Explore utilitários online úteis para várias tarefas do dia a dia.",
      "subLabel": "Utilitários Web",
      "subNavDescription": "Geradores e ferramentas para produtividade e criatividade.",
      "description": "De geradores de senhas seguras a criadores de postagens divertidas, nossa seção de utilitários está repleta de ferramentas web úteis."
    },
    "passwordGenerator": {
      "title": "Gerador de Senhas Gratuito",
      "label": "Gerador de Senhas",
      "navDescription": "Crie senhas seguras e aleatórias para proteger suas contas.",
      "subLabel": "Suite de Gerador de Senhas",
      "subNavDescription": "Gere instantaneamente senhas fortes e únicas.",
      "description": "Gerador de senhas: crie senhas seguras e aleatórias. Personalize comprimento e caracteres conforme suas necessidades.",
      "keywords": {
        "0": "Gerador de Senhas",
        "1": "Senhas Seguras",
        "2": "Criar Senha",
        "3": "Senha Aleatória",
        "4": "Gerar Senha",
        "5": "Senha Forte",
        "6": "Gerador de Senhas Online"
      },
      "page": {
        "description": "Gere senhas fortes e únicas",
        "generatePwd": "Regenerar Senha",
        "strong": {
          "label": "Forte",
          "message": "Excelente escolha!"
        },
        "moderate": {
          "label": "Moderada",
          "message": "Não é ruim, mas não é Fort Knox também."
        },
        "weak": {
          "label": "Fraca",
          "message": "Precisa de melhorias."
        },
        "pwLength": "Comprimento da senha",
        "form": {
          "uppercase": "Incluir letras maiúsculas",
          "lowercase": "Incluir letras minúsculas",
          "numbers": "Incluir números",
          "symbols": "Incluir símbolos"
        }
      },
      "autoGenerationMessage": "Sua senha será gerada automaticamente",
      "length": {
        "label": "Comprimento",
        "navDescription": "Selecione o comprimento da senha.",
        "title": "Gerador de Senhas Seguras | Personalize o Comprimento da Senha",
        "description": "Escolha o comprimento da sua senha para garantir segurança adequada. Recomendado: pelo menos 12 caracteres.",
        "input": "Insira o comprimento da senha aqui"
      },
      "characters": {
        "label": "Caracteres",
        "navDescription": "Selecione os tipos de caracteres a serem incluídos.",
        "title": "Gerador de Senhas Seguras | Personalize os Caracteres da Senha",
        "description": "Selecione os tipos de caracteres que deseja incluir em sua senha: letras, números, símbolos.",
        "input": "Selecione os caracteres desejados"
      },
      "docs": {
        "title": "🔐 Como Usar o Gerador de Senhas Rivine",
        "intro": "Gere senhas fortes e seguras em segundos! Personalize o comprimento, os tipos de caracteres e regenere senhas com apenas um clique.",
        "whatIs": {
          "title": "✨ O que é um Gerador de Senhas?",
          "description": "Um gerador de senhas cria senhas aleatórias e fortes para proteger suas contas. Você pode escolher tipos de caracteres específicos, como letras maiúsculas, números, símbolos e mais para atender às suas necessidades de segurança."
        },
        "features": {
          "title": "📦 Características do Gerador de Senhas",
          "length": {
            "title": "Comprimento Ajustável:",
            "description": "Defina o comprimento desejado da senha para corresponder às suas preferências de segurança."
          },
          "uppercase": {
            "title": "Incluir Letras Maiúsculas:",
            "description": "Opcionalmente inclua letras maiúsculas na sua senha."
          },
          "lowercase": {
            "title": "Incluir Letras Minúsculas:",
            "description": "Opcionalmente inclua letras minúsculas na sua senha."
          },
          "numbers": {
            "title": "Incluir Números:",
            "description": "Inclua dígitos para maior complexidade."
          },
          "symbols": {
            "title": "Incluir Símbolos:",
            "description": "Adicione caracteres especiais como !, @, #, etc., para tornar sua senha mais segura."
          }
        },
        "steps": {
          "title": "🚀 Como Gerar uma Senha",
          "step1": {
            "title": "Passo 1: Defina o Comprimento da Sua Senha",
            "description": "Use o controle deslizante para ajustar o comprimento da sua senha. Quanto mais longa a senha, mais segura ela será."
          },
          "step2": {
            "title": "Passo 2: Escolha Seus Tipos de Caracteres",
            "description": "Ative/desative para incluir letras maiúsculas, letras minúsculas, números e símbolos."
          },
          "step3": {
            "title": "Passo 3: Gere Sua Senha",
            "description": "Clique no botão 'Gerar' para criar uma senha aleatória e segura com base nas suas configurações escolhidas."
          },
          "step4": {
            "title": "Passo 4: Copie ou Regenere a Senha",
            "description": "Uma vez que sua senha é gerada, clique no botão 'Copiar' para salvá-la ou 'Regenerar' para criar uma nova."
          }
        },
        "exampleLabel": "Senha de Exemplo:",
        "copyButton": "Copiar",
        "regenerateButton": "Regenerar",
        "tips": {
          "title": "💡 Dicas Profissionais",
          "tip1": "Para melhor segurança, use um comprimento de senha de pelo menos 12 caracteres.",
          "tip2": "Incluir uma mistura de maiúsculas, minúsculas, números e símbolos aumenta a força da senha.",
          "tip3": "Evite reutilizar senhas em sites diferentes — crie uma senha única para cada conta."
        },
        "troubleshooting": {
          "title": "🛠️ Está com Problemas?",
          "lengthError": {
            "title": "Erro de Comprimento da Senha?",
            "description": "Certifique-se de que o comprimento da sua senha seja de pelo menos 8 caracteres para garantir segurança adequada."
          },
          "generationError": {
            "title": "Senha Não Está Gerando?",
            "description": "Verifique se todos os campos obrigatórios estão selecionados e se o comprimento é apropriado."
          }
        }
      }
    },
    "text": {
      "title": "Suite de Texto",
      "label": "Texto",
      "navDescription": "Acesse uma suíte abrangente de ferramentas de texto para todas as suas necessidades de processamento de texto.",
      "subLabel": "Suite de Texto Abrangente",
      "subNavDescription": "Explore uma variedade de ferramentas para gerenciar, comparar e analisar texto.",
      "description": "Nossa Suite de Ferramentas de Texto oferece uma ampla gama de utilitários para lidar com tarefas de processamento de texto de forma eficiente. De comparação a análise, personalize sua experiência para atender aos seus requisitos específicos."
    },
    "textCompare": {
      "title": "Comparação de Texto Gratuita",
      "label": "Comparação de Texto",
      "navDescription": "Compare dois textos para identificar diferenças e semelhanças.",
      "subLabel": "Suite de Comparação de Texto",
      "subNavDescription": "Compare e analise diferenças de texto sem esforço.",
      "description": "Compare textos online grátis: veja diferenças e semelhanças. Personalize para destacar mudanças.",
      "keywords": {
        "0": "Comparação de Texto",
        "1": "Comparar Textos",
        "2": "Diferenças de Texto",
        "3": "Semelhanças de Texto",
        "4": "Comparação de Texto Online",
        "5": "Análise de Texto",
        "6": "Comparar Documentos"
      },
      "page": {
        "description": "Compare e analise diferenças de texto",
        "compareText": "Comparar Textos",
        "select": {
          "char": "Caractere por Caractere",
          "word": "Palavra por Palavra",
          "line": "Linha por Linha"
        },
        "identical": "Os dois textos são idênticos",
        "diff": "diferenças encontradas",
        "textPlaceholder": "Digite ou cole o texto aqui...",
        "mergeL": "Mesclar à Esquerda",
        "mergeR": "Mesclar à Direita",
        "compare": "Comparar",
        "left": "Texto da Esquerda",
        "right": "Texto da Direita",
        "realTime": "Visualização em tempo real"
      },
      "docs": {
        "title": "🔍 Como Usar a Ferramenta de Comparação de Texto Rivine",
        "intro": "Compare dois textos lado a lado para identificar facilmente diferenças, analisar mudanças e mesclar conteúdo sem esforço.",
        "whatIs": {
          "title": "✨ O que é a Ferramenta de Comparação de Texto?",
          "description": "A ferramenta de Comparação de Texto é uma utilidade poderosa que permite identificar e visualizar diferenças entre dois documentos de texto. Seja comparando versões de código, documentos ou qualquer conteúdo de texto, ela destaca mudanças no nível de caractere, palavra ou linha para ajudar você a entender exatamente o que mudou."
        },
        "features": {
          "title": "📦 Recursos Principais",
          "dualView": {
            "title": "Editor de Texto Duplo",
            "description": "Áreas de texto lado a lado para fácil comparação do conteúdo esquerdo e direito."
          },
          "comparisonModes": {
            "title": "Múltiplos Modos de Comparação",
            "description": "Escolha entre métodos de comparação Caractere por Caractere, Palavra por Palavra ou Linha por Linha."
          },
          "realTime": {
            "title": "Visualização em Tempo Real",
            "description": "Ative a comparação em tempo real para ver as diferenças enquanto você digita."
          },
          "fileUpload": {
            "title": "Upload de Arquivos",
            "description": "Importe arquivos de texto diretamente para o editor esquerdo ou direito."
          },
          "merging": {
            "title": "Mesclagem de Texto",
            "description": "Mescle mudanças de um lado para o outro com botões de mesclagem dedicados."
          }
        },
        "comparisonModes": {
          "title": "🔄 Entendendo os Modos de Comparação",
          "character": {
            "title": "Caractere por Caractere",
            "description": "O método de comparação mais detalhado, destacando diferenças no nível de caractere individual. Perfeito para identificar pequenos erros de digitação ou mudanças menores de texto."
          },
          "word": {
            "title": "Palavra por Palavra",
            "description": "Compara texto tratando palavras como unidades. Este modo é ideal para edição de documentos e revisões de conteúdo onde palavras inteiras são frequentemente adicionadas, excluídas ou alteradas."
          },
          "line": {
            "title": "Linha por Linha",
            "description": "Compara texto linha por linha, semelhante a como funcionam as diferenças de código. Melhor para conteúdo estruturado como código, listas ou qualquer texto onde quebras de linha são significativas."
          }
        },
        "steps": {
          "title": "🚀 Como Comparar Textos",
          "step1": {
            "title": "Passo 1: Adicione Seus Textos",
            "description": "Digite ou cole seu texto original no editor esquerdo e o texto que você deseja comparar no editor direito. Alternativamente, use os botões de Upload para importar arquivos de texto."
          },
          "step2": {
            "title": "Passo 2: Selecione o Modo de Comparação",
            "description": "Escolha se deseja comparar Caractere por Caractere, Palavra por Palavra ou Linha por Linha no menu suspenso."
          },
          "step3": {
            "title": "Passo 3: Ative a Visualização em Tempo Real (Opcional)",
            "description": "Habilite a visualização em tempo real se desejar que as diferenças sejam destacadas automaticamente enquanto você digita."
          },
          "step4": {
            "title": "Passo 4: Revise as Diferenças",
            "description": "As diferenças serão destacadas com vermelho indicando conteúdo removido e verde indicando conteúdo adicionado. O painel inferior mostra uma comparação linha por linha para inspeção mais detalhada."
          }
        },
        "merging": {
          "title": "🔀 Mesclando Mudanças",
          "description": "A ferramenta de Comparação de Texto permite mesclar mudanças entre os editores de texto esquerdo e direito:",
          "mergeToRight": {
            "title": "Mesclar para a Direita",
            "description": "Copia conteúdo do editor esquerdo para o editor direito, sobrescrevendo o texto direito com o texto esquerdo."
          },
          "mergeToLeft": {
            "title": "Mesclar para a Esquerda",
            "description": "Copia conteúdo do editor direito para o editor esquerdo, sobrescrevendo o texto esquerdo com o texto direito."
          }
        },
        "exampleLabel": "Exemplo de Comparação:",
        "exampleLeft": "Texto Esquerdo:",
        "exampleRight": "Texto Direito:",
        "exampleNote": "Neste exemplo, 'antigo' foi substituído por 'atualizado', mostrado com destaque vermelho para conteúdo removido e verde para conteúdo adicionado.",
        "tips": {
          "title": "💡 Dicas Profissionais",
          "tip1": "Para comparação de código, o modo Linha por Linha geralmente funciona melhor para corresponder a como os sistemas de controle de versão mostram diferenças.",
          "tip2": "Ao comparar documentos longos, experimente primeiro o modo Palavra por Palavra para uma visão mais clara de mudanças substanciais.",
          "tip3": "Use o botão 'Upload' para comparar rapidamente arquivos do seu sistema local sem copiar e colar.",
          "tip4": "Para a comparação mais precisa ao trabalhar com texto formatado, primeiro remova qualquer formatação colando como texto sem formatação."
        },
        "troubleshooting": {
          "title": "🛠️ Está com Problemas?",
          "largeFiles": {
            "title": "Desempenho com Arquivos Grandes",
            "description": "Se comparar textos muito grandes causar lentidão, tente desativar a comparação em tempo real e use a comparação manual em vez disso."
          },
          "formatting": {
            "title": "Problemas de Formatação",
            "description": "A ferramenta compara apenas texto sem formatação. Se a formatação parecer diferente, certifique-se de que está colando como texto sem formatação sem caracteres de formatação ocultos."
          },
          "encoding": {
            "title": "Problemas de Codificação de Caracteres",
            "description": "Se caracteres especiais aparecerem de forma diferente nos dois textos, apesar de serem idênticos, verifique se ambos os textos usam a mesma codificação de caracteres."
          }
        }
      }
    },
    "json": {
      "title": "JSON",
      "label": "Ferramentas JSON",
      "navDescription": "Suite abrangente para todas as suas necessidades de JSON.",
      "subLabel": "Suite Completa de JSON",
      "subNavDescription": "Lide, edite e formate dados JSON sem esforço.",
      "description": "Explore nossa suíte abrangente de ferramentas JSON online gratuitas para editar, formatar, validar e analisar dados JSON. Personalize as configurações para melhorar sua experiência de manipulação de JSON."
    },
    "jsonEditor": {
      "title": "Editor de JSON Gratuito",
      "label": "Editor de JSON",
      "navDescription": "Edite e formate dados JSON com facilidade.",
      "subLabel": "Suite de Editor de JSON",
      "subNavDescription": "Edite e formate dados JSON sem esforço.",
      "description": "Editor JSON online grátis: edite e formate dados. Personalize configurações para uma melhor experiência.",
      "keywords": {
        "0": "Editor de JSON",
        "1": "Editar JSON",
        "2": "Formatador de JSON",
        "3": "Embelezador de JSON",
        "4": "Editor de JSON Online",
        "5": "Validador de JSON",
        "6": "Analisador de JSON",
        "7": "Verificador de Sintaxe JSON",
        "8": "Visualizador de JSON",
        "9": "Minificador de JSON",
        "10": "Impressão Bonita de JSON"
      },
      "docs": {
        "title": "🧩 Como Usar o Editor de JSON Rivine",
        "intro": "Edite, formate e transforme dados JSON com facilidade. A interface de editor duplo permite que você trabalhe com vários documentos JSON simultaneamente com recursos poderosos de visualização e edição.",
        "whatIs": {
          "title": "✨ O que é um Editor de JSON?",
          "description": "Um Editor de JSON é uma ferramenta que ajuda você a criar, editar e validar dados JSON (JavaScript Object Notation). Nosso editor fornece várias visualizações e recursos poderosos para tornar o trabalho com JSON fácil e eficiente."
        },
        "features": {
          "title": "📦 Recursos Principais",
          "dualEditor": {
            "title": "Interface de Editor Duplo",
            "description": "Trabalhe com dois documentos JSON lado a lado, facilitando a comparação, cópia ou fusão de conteúdo entre eles."
          },
          "viewModes": {
            "title": "Múltiplos Modos de Visualização",
            "description": "Alterne entre os modos Código, Árvore, Tabela e Visualização para visualizar seus dados JSON no formato mais útil."
          },
          "formatting": {
            "title": "Formatar e Embelezar",
            "description": "Formate e indente automaticamente seu JSON para melhor legibilidade com um único clique."
          },
          "search": {
            "title": "Buscar e Substituir",
            "description": "Encontre e substitua rapidamente valores dentro de seus documentos JSON, com suporte para expressões regulares."
          },
          "transform": {
            "title": "Transformar e Manipular",
            "description": "Classifique, filtre e transforme seus dados JSON usando ferramentas de transformação integradas."
          }
        },
        "modes": {
          "title": "📋 Modos de Visualização Explicados",
          "code": {
            "title": "Modo Código",
            "description": "Edite texto JSON bruto com destaque de sintaxe, autocompletar e detecção de erros."
          },
          "tree": {
            "title": "Modo Árvore",
            "description": "Navegue e edite JSON como uma estrutura de árvore colapsável, perfeito para dados aninhados."
          },
          "table": {
            "title": "Modo Tabela",
            "description": "Visualize e edite arrays JSON como tabelas com colunas ordenáveis."
          },
          "preview": {
            "title": "Modo Visualização",
            "description": "Veja uma visualização formatada e somente leitura de seus dados JSON, ideal para revisar conteúdo."
          }
        },
        "steps": {
          "title": "🚀 Como Usar o Editor de JSON",
          "step1": {
            "title": "Passo 1: Insira ou Importe JSON",
            "description": "Digite diretamente no editor, cole da área de transferência ou importe um arquivo JSON do seu dispositivo."
          },
          "step2": {
            "title": "Passo 2: Escolha Seu Modo de Visualização",
            "description": "Selecione entre os modos Código, Árvore, Tabela ou Visualização com base em suas necessidades de edição."
          },
          "step3": {
            "title": "Passo 3: Edite e Transforme",
            "description": "Modifique seus dados JSON usando os recursos do editor, incluindo adicionar, editar ou excluir propriedades."
          },
          "step4": {
            "title": "Passo 4: Exporte ou Copie",
            "description": "Copie seu JSON para a área de transferência ou exporte-o como um arquivo assim que concluir suas edições."
          }
        },
        "advancedFeatures": {
          "title": "🔧 Recursos Avançados",
          "filter": {
            "title": "Filtragem Baseada em Consulta",
            "description": "Filtre documentos JSON grandes usando expressões de consulta para se concentrar em dados específicos."
          },
          "sort": {
            "title": "Classificar Chaves e Valores",
            "description": "Organize seu JSON classificando chaves alfabeticamente ou valores numericamente."
          },
          "transform": {
            "title": "Transformação de JSON",
            "description": "Aplique transformações como achatamento de estruturas aninhadas, conversão de tipos ou reestruturação de dados."
          },
          "repair": {
            "title": "Corrigir JSON Malformado",
            "description": "Repare automaticamente erros de sintaxe comuns em documentos JSON malformados."
          },
          "navigation": {
            "title": "Navegação por Caminho",
            "description": "Navegue por estruturas JSON complexas usando expressões de caminho para localizar rapidamente nós específicos."
          }
        },
        "exampleLabel": "Exemplo de JSON:",
        "tips": {
          "title": "💡 Dicas Profissionais",
          "tip1": "Use atalhos de teclado (Ctrl+F para buscar, Ctrl+I para formatar) para acelerar seu fluxo de trabalho.",
          "tip2": "Para arquivos JSON grandes, a visualização em Árvore pode ajudá-lo a navegar e entender a estrutura melhor do que a visualização em Código.",
          "tip3": "Ao comparar dois documentos JSON, use o layout de editor duplo e o recurso de rolagem sincronizada.",
          "tip4": "Use o recurso 'Copiar Caminho' para obter o caminho JSON exato para um valor específico, útil para APIs e documentação."
        },
        "troubleshooting": {
          "title": "🛠️ Está com Problemas?",
          "invalidJson": {
            "title": "Erro de JSON Inválido?",
            "description": "Verifique a falta de vírgulas, vírgulas extras ou colchetes não fechados. O editor destacará erros de sintaxe para ajudá-lo a identificar problemas."
          },
          "performance": {
            "title": "Editor Está Lento?",
            "description": "Para arquivos JSON muito grandes (mais de 1MB), considere usar o modo Código em vez do modo Árvore para melhor desempenho."
          },
          "dataLoss": {
            "title": "Preocupado com Perda de Dados?",
            "description": "Use o recurso 'Salvar no Armazenamento Local' para fazer backup automático do seu trabalho enquanto edita."
          }
        }
      }
    },
    "image": {
      "title": "Suite de Imagens",
      "label": "Imagem",
      "navDescription": "Acesse uma suíte abrangente de ferramentas de imagem para todas as suas necessidades de processamento de imagens.",
      "subLabel": "Suite de Imagens Abrangente",
      "subNavDescription": "Explore uma variedade de ferramentas para gerenciar, editar e analisar imagens.",
      "description": "Nossa Suite de Ferramentas de Imagem oferece uma ampla gama de utilitários para lidar com tarefas de processamento de imagens de forma eficiente. De edição a análise, personalize sua experiência para atender aos seus requisitos específicos."
    },
    "imageMerge": {
      "title": "Ferramenta de Mesclagem de Imagens",
      "label": "Mesclagem de Imagens",
      "navDescription": "Combine várias imagens em uma única imagem sem esforço.",
      "subLabel": "Suite de Mesclagem de Imagens",
      "subNavDescription": "Mescle facilmente várias imagens em uma.",
      "description": "Mescle imagens facilmente: combine várias em uma só. Personalize configurações para uma experiência otimizada.",
      "keywords": {
        "0": "Mesclagem de Imagens",
        "1": "Combinar Imagens",
        "2": "Combinador de Imagens",
        "3": "Mesclar Fotos",
        "4": "Mesclagem de Imagens Online",
        "5": "Costura de Imagens",
        "6": "Colagem de Fotos",
        "7": "Unidor de Imagens",
        "8": "Mesclagem de Imagens",
        "9": "Fusão de Imagens",
        "10": "Mesclagem de Fotos",
        "11": "Sobreposição de Imagens",
        "12": "Misturador de Fotos",
        "13": "Montagem de Imagens",
        "14": "Composição de Imagens",
        "15": "Costura de Fotos",
        "16": "Criador de Colagens de Imagens",
        "17": "Editor de Fotos",
        "18": "Editor de Imagens",
        "19": "Manipulação de Imagens",
        "20": "Fusão de Fotos",
        "21": "Agregador de Imagens",
        "22": "Unidor de Fotos",
        "23": "Combinação de Imagens",
        "24": "Mesclagem de Fotos",
        "25": "Mesclagem de conversas do Whatsapp"
      },
      "page": {
        "title": "Mesclador de Imagens",
        "description": "Mescle facilmente várias imagens em uma",
        "image": "Imagem",
        "upload": "Carregar imagem",
        "size": "Tamanho da imagem",
        "selectSize": "Selecionar tamanho",
        "sizeOriginal": "Tamanho Original",
        "sizeMagnify": "Ampliar",
        "sizeCrop": "Cortar",
        "settings": "Configurações de Mesclagem",
        "noImages": "Número de Imagens",
        "positionTab": "Posição",
        "borderTab": "Borda",
        "imagePosition": "Posição da Imagem",
        "selectPosition": "Selecionar posição",
        "horizontal": "Horizontal (Lado a Lado)",
        "vertical": "Vertical (Uma Acima da Outra)",
        "sizeNor": "Normalização de Tamanho",
        "selNorm": "Selecionar normalização",
        "selNone": "Nenhum (Manter Proporções Originais)",
        "largest": "Ajustar à Maior Imagem",
        "smallest": "Ajustar à Menor Imagem",
        "borderType": "Tipo de Borda",
        "selBorder": "Selecionar tipo de borda",
        "between": "Entre Imagens",
        "aroundEach": "Ao Redor de Cada Imagem",
        "aroundAll": "Ao Redor do Resultado Mesclado",
        "borderStyle": "Estilo de Borda",
        "selStyle": "Selecionar estilo de borda",
        "solid": "Sólido",
        "dashed": "Tracejado",
        "dotted": "Pontilhado",
        "borderWidth": "Largura da Borda",
        "borderColor": "Cor da Borda",
        "result": "Resultado Mesclado",
        "error": "Carregue pelo menos uma imagem para ver o resultado mesclado",
        "download": "Baixar Imagem Mesclada",
        "tune": "Ajuste as configurações de mesclagem para obter o resultado desejado"
      },
      "docs": {
        "title": "🖼️ Como Usar a Ferramenta de Fusão de Imagens",
        "intro": "Combine facilmente várias imagens em uma única imagem composta com layouts e configurações personalizáveis.",
        "whatIs": {
          "title": "✨ O que é a Ferramenta de Fusão de Imagens?",
          "description": "A ferramenta de Fusão de Imagens é uma utilidade poderosa que permite combinar várias imagens em uma única imagem composta. Seja para criar colagens, imagens de comparação ou exibições multipainel, esta ferramenta ajuda a organizar e mesclar imagens com opções de posicionamento e formatação personalizáveis."
        },
        "features": {
          "title": "📦 Recursos Principais",
          "multipleImages": {
            "title": "Suporte a Múltiplas Imagens",
            "description": "Combine entre 2 e 10 imagens em uma única saída mesclada."
          },
          "positionOptions": {
            "title": "Posicionamento Flexível",
            "description": "Organize imagens horizontalmente lado a lado, empilhadas verticalmente ou em um layout de grade."
          },
          "sizeControl": {
            "title": "Normalização de Tamanho",
            "description": "Escolha como as imagens são dimensionadas em relação umas às outras ao mesclar."
          },
          "borderOptions": {
            "title": "Personalização de Bordas",
            "description": "Adicione e personalize bordas entre imagens para uma separação clara."
          },
          "imageSettings": {
            "title": "Configurações de Imagem Individual",
            "description": "Controle o tamanho e a aparência de cada imagem de forma independente."
          }
        },
        "steps": {
          "title": "🚀 Como Mesclar Imagens",
          "step1": {
            "title": "Passo 1: Faça o Upload de Suas Imagens",
            "description": "Clique no botão 'Fazer upload de imagem' em cada painel de imagem para adicionar suas imagens de origem. Você precisa de pelo menos 2 imagens para realizar uma mesclagem."
          },
          "step2": {
            "title": "Passo 2: Defina o Número de Imagens",
            "description": "Use os botões '+' e '-' para ajustar o número de imagens que deseja mesclar (mínimo 2, máximo 10)."
          },
          "step3": {
            "title": "Passo 3: Escolha a Posição da Imagem",
            "description": "Selecione o estilo de arranjo no menu suspenso 'Posição da Imagem': Horizontal (lado a lado), Vertical (empilhadas) ou Layout de Grade."
          },
          "step4": {
            "title": "Passo 4: Ajuste a Normalização de Tamanho",
            "description": "Selecione como as imagens devem ser dimensionadas em relação umas às outras. As opções incluem 'Ajustar à Menor Imagem', 'Igualar à Maior Imagem' ou 'Manter Tamanhos Originais'."
          },
          "step5": {
            "title": "Passo 5: Configure as Configurações de Bordas (Opcional)",
            "description": "Clique na guia 'Borda' para adicionar e personalizar bordas entre imagens, incluindo largura, cor e estilo da borda."
          },
          "step6": {
            "title": "Passo 6: Visualize e Baixe",
            "description": "O resultado mesclado será exibido automaticamente. Quando estiver satisfeito com o resultado, baixe sua imagem mesclada."
          }
        },
        "positionModes": {
          "title": "🔄 Opções de Posição de Imagem",
          "horizontal": {
            "title": "Horizontal (Lado a Lado)",
            "description": "Coloca imagens lado a lado em uma linha. Ideal para comparar imagens lado a lado ou criar composições panorâmicas."
          },
          "vertical": {
            "title": "Vertical (Empilhadas)",
            "description": "Empilha imagens uma sobre a outra. Ideal para comparações de antes e depois ou exibições sequenciais."
          },
          "grid": {
            "title": "Layout de Grade",
            "description": "Organiza imagens em um padrão de grade. Perfeito para criar colagens ou quando se trabalha com várias imagens de importância semelhante."
          }
        },
        "sizeOptions": {
          "title": "📏 Opções de Normalização de Tamanho",
          "fitToSmallest": {
            "title": "Ajustar à Menor Imagem",
            "description": "Dimensiona todas as imagens para corresponder às dimensões da menor imagem. Garante consistência, mas pode reduzir imagens maiores."
          },
          "matchLargest": {
            "title": "Igualar à Maior Imagem",
            "description": "Dimensiona todas as imagens para corresponder às dimensões da maior imagem. Preserva detalhes em imagens grandes, mas aumenta o tamanho do arquivo de saída."
          },
          "originalSize": {
            "title": "Manter Tamanhos Originais",
            "description": "Mantém as dimensões originais de cada imagem. Resulta em uma composição assimétrica, mas preserva todos os detalhes originais."
          }
        },
        "borderOptions": {
          "title": "🖌️ Personalização de Bordas",
          "width": {
            "title": "Largura da Borda",
            "description": "Defina a espessura das bordas entre imagens de 0 (sem borda) até 20 pixels."
          },
          "color": {
            "title": "Cor da Borda",
            "description": "Escolha qualquer cor para as bordas para complementar suas imagens ou criar separação visual."
          },
          "style": {
            "title": "Estilo da Borda",
            "description": "Selecione estilos de borda, incluindo linhas sólidas, tracejadas ou pontilhadas."
          }
        },
        "imageLimit": {
          "title": "📱 Limites de Imagens",
          "description": "A ferramenta de Fusão de Imagens requer um mínimo de 2 imagens e permite um máximo de 10 imagens para serem combinadas de uma vez."
        },
        "tips": {
          "title": "💡 Dicas Profissionais",
          "tip1": "Para melhores resultados ao usar o modo 'Lado a Lado', escolha imagens com alturas semelhantes.",
          "tip2": "Ao criar uma pilha vertical, imagens com larguras semelhantes funcionam melhor juntas.",
          "tip3": "O layout de grade organiza automaticamente as imagens na formação mais equilibrada com base no número de imagens.",
          "tip4": "Adicionar uma borda pode ajudar a distinguir entre imagens com cores ou conteúdo semelhantes.",
          "tip5": "Considere usar 'Ajustar à Menor Imagem' para processamento mais rápido e tamanhos de arquivo menores."
        },
        "troubleshooting": {
          "title": "🛠️ Está com Problemas?",
          "notMerging": {
            "title": "Imagens Não Estão Mesclando",
            "description": "Certifique-se de ter feito o upload de pelo menos dois arquivos de imagem válidos. A visualização da mesclagem é exibida automaticamente assim que imagens suficientes são carregadas."
          },
          "qualityIssues": {
            "title": "Perda de Qualidade",
            "description": "Se as imagens mescladas parecerem de qualidade inferior às originais, tente as configurações 'Manter Tamanhos Originais' ou 'Igualar à Maior Imagem' para preservar os detalhes."
          },
          "layoutProblems": {
            "title": "Problemas de Layout",
            "description": "Se o layout mesclado não parecer correto, tente uma configuração de posição diferente ou normalize os tamanhos das imagens para uma composição mais equilibrada."
          }
        }
      }
    },
    "textToHandwriting": {
      "title": "Ferramenta de Texto para Escrita à Mão",
      "label": "Texto para Escrita à Mão",
      "navDescription": "Converta texto digitado em escrita à mão realista sem esforço.",
      "subLabel": "Suíte de Escrita à Mão",
      "subNavDescription": "Transforme facilmente texto em notas manuscritas.",
      "description": "Converta texto digitado em escrita à mão realista. Personalize para aprimorar sua experiência.",
      "keywords": {
        "0": "Texto para Escrita à Mão",
        "1": "Conversor de Escrita à Mão",
        "2": "Texto para Roteiro",
        "3": "Notas Manuscritas",
        "4": "Ferramenta de Escrita à Mão Online",
        "5": "Texto para Cursiva",
        "6": "Gerador de Escrita à Mão",
        "7": "Texto para Caligrafia",
        "8": "Conversor de Roteiro",
        "9": "Texto para Caligrafia",
        "10": "Simulação de Escrita à Mão",
        "11": "Texto para Manuscrito",
        "12": "Criador de Escrita à Mão",
        "13": "Texto para Letra",
        "14": "Estilo de Escrita à Mão",
        "15": "Texto para Tinta",
        "16": "Editor de Escrita à Mão",
        "17": "Texto para Fonte",
        "18": "Personalização de Escrita à Mão",
        "19": "Texto para Escrita",
        "20": "Transformação de Escrita à Mão",
        "21": "Texto para Manuscrito",
        "22": "Criador de Roteiro",
        "23": "Conversor de Texto para Escrita à Mão",
        "24": "Gerador de Texto para Escrita à Mão",
        "25": "Editor de Texto para Escrita à Mão"
      },
      "page": {
        "title": "Texto para Escrita à Mão",
        "description": "Converta facilmente texto digitado em escrita à mão realista",
        "yourText": "Seu Texto",
        "font": "Fonte de Escrita à Mão",
        "selFont": "Selecionar fonte",
        "pageSize": "Tamanho da Página",
        "selPSize": "Selecionar tamanho da página",
        "fontSize": "Tamanho da Fonte",
        "lineSpacing": "Espaçamento de Linhas",
        "verticalPosition": "Posição Vertical",
        "wordSpacing": "Espaçamento de Palavras",
        "letterSpacing": "Espaçamento de Letras",
        "leftMargin": "Margem Esquerda",
        "topMargin": "Margem Superior",
        "inkColor": "Cor da Tinta",
        "pageBackground": "Fundo da Página",
        "marginColor": "Cor da Margem",
        "lineColor": "Cor da Linha",
        "showMargin": "Mostrar Margem",
        "showPageLines": "Mostrar Linhas da Página",
        "addToBook": "Adicionar ao Livro",
        "downloadAsImage": "Baixar como Imagem",
        "downloadAsPdf": "Baixar como PDF",
        "downloadAllImages": "Baixar Todas as Imagens",
        "emptyBook": "Seu livro está vazio",
        "empBookDes": "Adicione páginas do editor ou carregue imagens para criar seu livro",
        "page": "Página",
        "handwrittenText": "Texto Manuscrito",
        "image": "Imagem",
        "note": "Se as linhas ou texto se sobrepuserem, ajuste as configurações. Para baixar várias páginas, use \"Adicionar ao Livro\" e role para baixo para baixar."
      },
      "docs": {
        "title": "🖋️ Como Usar a Ferramenta de Texto para Caligrafia",
        "intro": "Converta texto digitado em caligrafia realista com estilos personalizáveis e opções de formatação.",
        "whatIs": {
          "title": "✨ O que é a Ferramenta de Texto para Caligrafia?",
          "description": "A ferramenta de Texto para Caligrafia é uma utilidade versátil que transforma texto digital em conteúdo manuscrito de aparência autêntica. Seja criando notas, cartas, materiais de estudo ou projetos criativos, esta ferramenta dá ao seu texto digital um toque pessoal manuscrito com várias opções de personalização."
        },
        "features": {
          "title": "📦 Recursos Principais",
          "fonts": {
            "title": "Fontes de Caligrafia Realistas",
            "description": "Escolha entre vários estilos de caligrafia para encontrar a combinação perfeita para suas necessidades."
          },
          "customization": {
            "title": "Aparência Personalizável",
            "description": "Ajuste o tamanho da fonte, espaçamento, margens e posicionamento para criar a aparência manuscrita ideal."
          },
          "colorOptions": {
            "title": "Opções de Cor",
            "description": "Personalize a cor da tinta, o fundo da página e as cores das linhas de acordo com suas preferências."
          },
          "pageFormat": {
            "title": "Controle de Formato de Página",
            "description": "Selecione tamanhos de papel e alterne elementos de página como margens e linhas."
          },
          "multiPage": {
            "title": "Suporte a Múltiplas Páginas",
            "description": "Crie e gerencie várias páginas de conteúdo manuscrito em um único documento."
          },
          "exportOptions": {
            "title": "Opções de Exportação",
            "description": "Baixe páginas individuais como imagens ou compile várias páginas em um único livro PDF."
          }
        },
        "steps": {
          "title": "🚀 Como Usar a Ferramenta",
          "step1": {
            "title": "Passo 1: Insira Seu Texto",
            "description": "Digite ou cole seu texto na área do editor no lado esquerdo da tela. O texto será renderizado como caligrafia no painel de visualização à direita."
          },
          "step2": {
            "title": "Passo 2: Selecione o Estilo de Caligrafia",
            "description": "Escolha seu estilo de caligrafia preferido no menu suspenso 'Fonte de Caligrafia'. Cada fonte oferece uma aparência manuscrita única."
          },
          "step3": {
            "title": "Passo 3: Personalize a Formatação",
            "description": "Ajuste o tamanho da fonte, espaçamento de linhas, espaçamento de palavras, espaçamento de letras, margens e tamanho da página para aperfeiçoar seu documento manuscrito."
          },
          "step4": {
            "title": "Passo 4: Personalize as Cores",
            "description": "Escolha cores para a tinta, fundo da página, linhas e margem para criar sua estética desejada."
          },
          "step5": {
            "title": "Passo 5: Altere Elementos Visuais",
            "description": "Use os interruptores para mostrar ou ocultar margens de página e linhas de acordo com sua preferência."
          }
        },
        "multiPage": {
          "title": "🔀 Criando Documentos de Múltiplas Páginas",
          "description": "A ferramenta de Texto para Caligrafia permite construir documentos de múltiplas páginas:",
          "addPages": {
            "title": "Adicionando Páginas ao Seu Livro",
            "description": "Formate seu texto, clique em 'Adicionar ao Livro', depois crie novas páginas modificando o texto e repetindo o processo."
          },
          "managingBook": {
            "title": "Gerenciando Seu Livro",
            "description": "Todas as páginas adicionadas ao seu livro aparecerão na área do livro na parte inferior da tela."
          }
        },
        "downloading": {
          "title": "📥 Baixando Seu Conteúdo",
          "singlePage": {
            "title": "Download de Página Individual",
            "description": "Use o botão 'Baixar como Imagem' para salvar a página atual como um arquivo de imagem."
          },
          "multiPage": {
            "title": "Opções de Download de Múltiplas Páginas",
            "description": "Após adicionar páginas ao seu livro, use 'Baixar como PDF' para compilar todas as páginas em um único documento ou 'Baixar Todas as Imagens' para arquivos individuais."
          }
        },
        "tips": {
          "title": "💡 Dicas Profissionais",
          "tip1": "Se as linhas ou o texto se sobrepuserem, ajuste as configurações de espaçamento para melhor legibilidade.",
          "tip2": "Para formatação consistente em várias páginas, anote suas configurações antes de adicionar cada nova página.",
          "tip3": "O recurso 'Adicionar ao Livro' é essencial para criar documentos de múltiplas páginas que você pode baixar juntos como um PDF.",
          "tip4": "Experimente diferentes fontes de caligrafia para encontrar o estilo que melhor atende às suas necessidades.",
          "tip5": "Use o painel de visualização para ver como suas configurações afetam a aparência final antes de baixar."
        },
        "troubleshooting": {
          "title": "🛠️ Está com Problemas?",
          "layout": {
            "title": "Problemas de Layout de Página",
            "description": "Se o texto aparecer cortado ou sobreposto, tente reduzir o tamanho da fonte, aumentar o espaçamento de linhas ou ajustar as configurações de margem."
          },
          "download": {
            "title": "Problemas de Download",
            "description": "Certifique-se de clicar em 'Adicionar ao Livro' para cada página que deseja incluir no seu PDF e verifique se todas as páginas estão adicionadas antes de baixar."
          },
          "rendering": {
            "title": "Renderização de Texto",
            "description": "Se a caligrafia parecer inconsistente, tente ajustar o espaçamento de letras e palavras, e certifique-se de que seu texto não contenha caracteres especiais não suportados."
          }
        }
      }
    },
    "characterCounter": {
      "title": "Ferramenta de Contador de Caracteres",
      "label": "Contador de Caracteres",
      "navDescription": "Conte caracteres e palavras no seu texto sem esforço.",
      "subLabel": "Suíte de Contador de Caracteres",
      "subNavDescription": "Conte facilmente caracteres e palavras no seu texto.",
      "description": "Use nossa Ferramenta de Contador de Caracteres para contar rapidamente o número de caracteres e palavras no seu texto.",
      "keywords": {
        "0": "Contador de Caracteres",
        "1": "Contagem de Caracteres",
        "2": "Contador de Caracteres Online",
        "3": "Análise de Caracteres",
        "4": "Verificador de Caracteres",
        "5": "Estatísticas de Caracteres",
        "6": "Ferramenta de Caracteres",
        "7": "Agregador de Caracteres",
        "8": "Composição de Caracteres"
      },
      "page": {
        "title": "Contador de Caracteres",
        "description": "Conte caracteres e palavras no seu texto sem esforço."
      },
      "input": {
        "label": "Digite seu texto",
        "placeholder": "Digite ou cole seu texto aqui..."
      },
      "processedText": {
        "title": "Pré-visualização do Texto Processado",
        "empty": "Nenhum texto após aplicar filtros"
      },
      "countDisplay": {
        "title": "Contagem de Caracteres",
        "increasing": "aumentando",
        "decreasing": "diminuindo"
      },
      "options": {
        "counting": {
          "title": "Opções de Contagem",
          "stopAt": {
            "label": "Parar de contar em",
            "placeholder": "Digite letra ou palavra",
            "help": "Conte apenas até esta letra ou palavra"
          },
          "ignoreChars": {
            "label": "Ignorar caracteres específicos",
            "placeholder": "ex. abc",
            "help": "Caracteres a excluir da contagem"
          },
          "trim": "Cortar espaços em branco antes de contar"
        },
        "ignore": {
          "title": "Opções de Ignorar",
          "numbers": "Ignorar números",
          "symbols": "Ignorar símbolos",
          "uppercase": "Ignorar letras maiúsculas",
          "lowercase": "Ignorar letras minúsculas",
          "whitespace": "Ignorar espaços em branco"
        }
      },
      "docs": {
        "title": "🔢 Como Usar a Ferramenta de Contador de Caracteres",
        "intro": "Conte e analise texto facilmente com filtros e opções personalizáveis.",
        "whatIs": {
          "title": "✨ O que é a Ferramenta de Contador de Caracteres?",
          "description": "A ferramenta de Contador de Caracteres é uma utilidade poderosa que permite contar caracteres no seu texto com precisão. Seja para contar para postagens em redes sociais, conteúdo SEO ou tarefas de programação, esta ferramenta ajuda a analisar texto com filtros personalizáveis e opções de formatação."
        },
        "features": {
          "title": "📦 Principais Características",
          "realTimeCount": {
            "title": "Contagem de Caracteres em Tempo Real",
            "description": "Veja sua contagem de caracteres atualizar instantaneamente enquanto você digita ou edita seu texto."
          },
          "filterOptions": {
            "title": "Filtros Personalizáveis",
            "description": "Filtre caracteres específicos, números, símbolos ou espaços em branco da sua contagem."
          },
          "stopAt": {
            "title": "Análise Parcial de Texto",
            "description": "Conte caracteres até um caractere ou palavra específica no seu texto."
          },
          "caseOptions": {
            "title": "Opções de Sensibilidade de Maiúsculas",
            "description": "Inclua ou exclua letras maiúsculas ou minúsculas da sua contagem."
          },
          "trimWhitespace": {
            "title": "Gestão de Espaços em Branco",
            "description": "Opcionalmente corte espaços em branco antes e depois de contar."
          }
        },
        "steps": {
          "title": "🚀 Como Usar o Contador de Caracteres",
          "step1": {
            "title": "Passo 1: Digite Seu Texto",
            "description": "Digite ou cole seu texto no campo de entrada. A contagem de caracteres será atualizada automaticamente à medida que você fizer alterações."
          },
          "step2": {
            "title": "Passo 2: Veja Sua Contagem de Caracteres",
            "description": "O número de caracteres no seu texto é exibido de forma proeminente no contador. A contagem é atualizada em tempo real enquanto você edita seu texto."
          },
          "step3": {
            "title": "Passo 3: Aplique Filtros (Opcional)",
            "description": "Use as opções de filtro para personalizar o que é contado. Você pode excluir caracteres específicos, números, símbolos ou espaços em branco."
          },
          "step4": {
            "title": "Passo 4: Defina Limites de Contagem (Opcional)",
            "description": "Se você deseja contar apenas até um certo ponto no seu texto, digite um caractere ou palavra no campo 'Parar de contar em'."
          },
          "step5": {
            "title": "Passo 5: Pré-visualize e Copie Resultados",
            "description": "Veja seu texto processado e a contagem final de caracteres. Você pode copiar a contagem para sua área de transferência, se necessário."
          }
        },
        "countingOptions": {
          "title": "⚙️ Opções de Contagem",
          "stopAt": {
            "title": "Parar de Contar Em",
            "description": "Limita a contagem para incluir apenas caracteres até um caractere ou palavra específica. Útil para verificar se o texto se encaixa em limites específicos."
          },
          "ignoreChars": {
            "title": "Ignorar Caracteres Específicos",
            "description": "Exclua caracteres específicos da contagem. Digite os caracteres que deseja ignorar sem separadores."
          },
          "trimText": {
            "title": "Cortar Espaços em Branco",
            "description": "Remove espaços em branco antes e depois de contar. Útil para contagens mais precisas quando espaços em branco não devem ser incluídos."
          }
        },
        "ignoreOptions": {
          "title": "🚫 Opções de Ignorar",
          "numbers": {
            "title": "Ignorar Números",
            "description": "Exclui todos os dígitos numéricos (0-9) da contagem de caracteres."
          },
          "symbols": {
            "title": "Ignorar Símbolos",
            "description": "Exclui todos os caracteres especiais e símbolos da contagem, focando apenas em caracteres alfanuméricos."
          },
          "uppercase": {
            "title": "Ignorar Letras Maiúsculas",
            "description": "Exclui todas as letras maiúsculas da contagem. Útil quando você deseja contar apenas conteúdo em minúsculas."
          },
          "lowercase": {
            "title": "Ignorar Letras Minúsculas",
            "description": "Exclui todas as letras minúsculas da contagem. Útil quando você deseja contar apenas conteúdo em maiúsculas."
          },
          "whitespace": {
            "title": "Ignorar Espaços em Branco",
            "description": "Exclui todos os espaços, tabulações e quebras de linha da contagem. Fornece uma contagem apenas de caracteres visíveis."
          }
        },
        "preview": {
          "title": "👁️ Pré-visualização do Texto Processado",
          "description": "Mostra seu texto após todos os filtros terem sido aplicados. Este é o texto exato que está sendo usado para a contagem de caracteres."
        },
        "tips": {
          "title": "💡 Dicas Profissionais",
          "tip1": "Use 'Ignorar Espaços em Branco' ao contar caracteres para codificação ou quando espaços não devem contar para o seu total.",
          "tip2": "O recurso 'Parar de contar em' é perfeito para verificar se o seu texto se encaixará nos limites de caracteres para plataformas de redes sociais.",
          "tip3": "Para otimização de tags de título SEO, use o contador sem filtros para permanecer dentro dos limites de caracteres recomendados.",
          "tip4": "Ao contar palavras que contêm formatação especial, use as opções de ignorar para contar apenas os caracteres que importam para você.",
          "tip5": "A pré-visualização do texto processado ajuda você a entender exatamente o que está sendo contado após todos os seus filtros serem aplicados."
        },
        "troubleshooting": {
          "title": "🛠️ Está com Problemas?",
          "unexpectedCount": {
            "title": "Contagem de Caracteres Inesperada",
            "description": "Se a sua contagem parecer errada, verifique se há filtros habilitados. A pré-visualização do texto processado mostra exatamente o que está sendo contado."
          },
          "filterInteraction": {
            "title": "Conflitos de Filtros",
            "description": "Habilitar muitos filtros pode resultar em muito pouco texto para contar. Use a pré-visualização do texto processado para ver o que resta após o filtro."
          },
          "performanceIssues": {
            "title": "Desempenho com Texto Grande",
            "description": "Para texto muito grande, o contador pode demorar um momento para atualizar. Seja paciente ou tente dividir seu texto em seções menores."
          }
        }
      }
    },
    "wordCounter": {
      "title": "Ferramenta de Contador de Palavras",
      "label": "Contador de Palavras",
      "navDescription": "Conte palavras no seu texto sem esforço.",
      "subLabel": "Suite de Contador de Palavras",
      "subNavDescription": "Conte palavras no seu texto facilmente com filtros personalizados.",
      "description": "Use nossa Ferramenta de Contador de Palavras para contar rapidamente o número de palavras no seu texto.",
      "keywords": {
        "0": "Contador de Palavras",
        "1": "Contagem de Palavras",
        "2": "Contador de Palavras Online",
        "3": "Análise de Palavras",
        "4": "Verificador de Palavras",
        "5": "Estatísticas de Palavras",
        "6": "Ferramenta de Palavras",
        "7": "Frequência de Palavras",
        "8": "Calculadora de Palavras"
      },
      "page": {
        "title": "Contador de Palavras",
        "description": "Conte palavras no seu texto com filtros e opções personalizáveis."
      },
      "input": {
        "label": "Digite seu texto",
        "placeholder": "Digite ou cole seu texto aqui..."
      },
      "processedText": {
        "title": "Pré-visualização do Texto Processado",
        "empty": "Nenhum texto após aplicar filtros"
      },
      "countDisplay": {
        "title": "Contagem de Palavras",
        "increasing": "aumentando",
        "decreasing": "diminuindo",
        "char": "Contagem de Caracteres"
      },
      "options": {
        "dialog": {
          "edit": "Editar lista de palavras comuns",
          "title": "Editar Palavras Comuns",
          "save": "Salvar Alterações",
          "description": "Digite palavras comuns separadas por vírgulas que você deseja excluir da sua contagem de palavras."
        },
        "counting": {
          "title": "Opções de Contagem",
          "stopAtWord": {
            "label": "Parar de contar em",
            "placeholder": "Digite a palavra",
            "help": "Conte apenas até esta palavra"
          },
          "minWordLength": {
            "label": "Comprimento mínimo da palavra",
            "placeholder": "ex. 3",
            "help": "Conte apenas palavras com este número de caracteres ou mais"
          },
          "maxWordLength": {
            "label": "Comprimento máximo da palavra",
            "placeholder": "ex. 15",
            "help": "Conte apenas palavras com este número de caracteres ou menos"
          },
          "trim": "Cortar espaços em branco antes de contar"
        },
        "wordTypes": {
          "title": "Tipos de Palavras",
          "ignoreCommonWords": "Ignorar palavras comuns (a, o, e, etc.)",
          "countNumbers": "Contar números como palavras",
          "countHyphenatedAsOne": "Contar palavras hifenizadas como uma palavra",
          "countAbbreviations": "Contar abreviações como palavras"
        }
      },
      "docs": {
        "title": "📝 Como Usar a Ferramenta de Contador de Palavras",
        "intro": "Conte e analise palavras facilmente com filtros e opções personalizáveis.",
        "whatIs": {
          "title": "✨ O que é a Ferramenta de Contador de Palavras?",
          "description": "A ferramenta de Contador de Palavras é uma utilidade poderosa que permite contar palavras no seu texto com precisão. Seja para verificar contagens de palavras para ensaios, artigos, postagens em redes sociais ou conteúdo de SEO, esta ferramenta ajuda a analisar texto com filtros personalizáveis e opções específicas de palavras."
        },
        "features": {
          "title": "📦 Principais Características",
          "realTimeCount": {
            "title": "Contagem de Palavras em Tempo Real",
            "description": "Veja sua contagem de palavras atualizar instantaneamente enquanto você digita ou edita seu texto."
          },
          "filterOptions": {
            "title": "Filtros Personalizáveis",
            "description": "Filtre sua contagem com base em tipos de palavras, palavras comuns e outros critérios."
          },
          "wordLength": {
            "title": "Controle de Comprimento de Palavra",
            "description": "Conte apenas palavras que atendam a requisitos de comprimento específicos."
          },
          "wordTypes": {
            "title": "Filtragem de Tipos de Palavras",
            "description": "Escolha quais tipos de palavras incluir na sua contagem, como números, abreviações e palavras hifenizadas."
          },
          "trimWhitespace": {
            "title": "Gestão de Espaços em Branco",
            "description": "Opcionalmente, corte espaços em branco antes e depois de contar."
          }
        },
        "steps": {
          "title": "🚀 Como Usar o Contador de Palavras",
          "step1": {
            "title": "Passo 1: Digite Seu Texto",
            "description": "Digite ou cole seu texto no campo de entrada. A contagem de palavras será atualizada automaticamente à medida que você fizer alterações."
          },
          "step2": {
            "title": "Passo 2: Veja Sua Contagem de Palavras",
            "description": "O número de palavras no seu texto é exibido de forma proeminente no contador. A contagem é atualizada em tempo real enquanto você edita seu texto."
          },
          "step3": {
            "title": "Passo 3: Aplique Filtros (Opcional)",
            "description": "Use as opções de filtro para personalizar o que é contado. Você pode excluir palavras comuns, definir requisitos de comprimento de palavra e filtrar por tipos de palavras."
          },
          "step4": {
            "title": "Passo 4: Defina Limites de Contagem (Opcional)",
            "description": "Se você deseja contar apenas até um certo ponto no seu texto, digite uma palavra no campo 'Parar de contar em'."
          },
          "step5": {
            "title": "Passo 5: Pré-visualize e Copie Resultados",
            "description": "Veja seu texto processado e a contagem final de palavras. Você pode copiar a contagem para sua área de transferência, se necessário."
          }
        },
        "countingOptions": {
          "title": "⚙️ Opções de Contagem",
          "stopAtWord": {
            "title": "Parar de Contar em",
            "description": "Limita a contagem para incluir apenas palavras até uma palavra específica. Útil para verificar se o texto se encaixa em limites de palavras específicos ou para analisar seções de textos mais longos."
          },
          "minWordLength": {
            "title": "Comprimento Mínimo da Palavra",
            "description": "Conta apenas palavras que tenham pelo menos este número de caracteres. Útil para excluir palavras muito curtas como 'a', 'um', 'o', etc."
          },
          "maxWordLength": {
            "title": "Comprimento Máximo da Palavra",
            "description": "Conta apenas palavras que tenham no máximo este número de caracteres. Útil para excluir palavras muito longas ou possíveis erros no seu texto."
          },
          "trimText": {
            "title": "Cortar Espaços em Branco",
            "description": "Remove espaços em branco antes e depois de contar. Útil para contagens mais precisas quando espaços em branco não devem afetar sua contagem de palavras."
          }
        },
        "wordTypes": {
          "title": "🔤 Tipos de Palavras",
          "ignoreCommonWords": {
            "title": "Ignorar Palavras Comuns",
            "description": "Exclui palavras comuns como 'o', 'a', 'um', 'e', etc. da contagem. Útil para focar nas palavras de conteúdo mais significativas."
          },
          "countNumbers": {
            "title": "Contar Números",
            "description": "Quando ativado, trata cadeias numéricas (como '42' ou '2025') como palavras. Quando desativado, os números não serão incluídos na contagem de palavras."
          },
          "countHyphenatedAsOne": {
            "title": "Contar Palavras Hifenizadas como Uma",
            "description": "Quando ativado, trata termos hifenizados (como 'estado-da-arte') como uma única palavra. Quando desativado, cada parte é contada separadamente."
          },
          "countAbbreviations": {
            "title": "Contar Abreviações",
            "description": "Quando ativado, inclui abreviações e acrônimos (como 'EUA' ou 'NASA') na contagem de palavras. Quando desativado, eles são excluídos."
          }
        },
        "preview": {
          "title": "👁️ Pré-visualização do Texto Processado",
          "description": "Mostra seu texto após todos os filtros terem sido aplicados. Este é o texto exato que está sendo usado para a contagem de palavras."
        },
        "tips": {
          "title": "💡 Dicas Profissionais",
          "tip1": "Use 'Comprimento Mínimo da Palavra' para focar em palavras de conteúdo mais significativas e filtrar artigos curtos e preposições.",
          "tip2": "O recurso 'Parar de contar em' é perfeito para verificar se sua introdução se encaixa em um limite de palavras específico.",
          "tip3": "Para escrita acadêmica, ative 'Contar Palavras Hifenizadas como Uma' para corresponder às regras de contagem de palavras da maioria dos guias de estilo.",
          "tip4": "Use 'Ignorar Palavras Comuns' quando quiser analisar a densidade de termos-chave no seu conteúdo.",
          "tip5": "A pré-visualização do texto processado ajuda você a entender exatamente o que está sendo contado após todos os seus filtros serem aplicados."
        },
        "troubleshooting": {
          "title": "🛠️ Está com Problemas?",
          "unexpectedCount": {
            "title": "Contagem de Palavras Inesperada",
            "description": "Se sua contagem parecer errada, verifique se há filtros ativados. A pré-visualização do texto processado mostra exatamente o que está sendo contado."
          },
          "filterInteraction": {
            "title": "Conflitos de Filtros",
            "description": "Usar vários filtros juntos pode reduzir significativamente sua contagem de palavras. Por exemplo, definir um comprimento mínimo de palavra alto enquanto ignora palavras comuns pode filtrar uma grande parte do seu texto."
          },
          "performanceIssues": {
            "title": "Desempenho com Texto Grande",
            "description": "Para documentos muito grandes, o contador pode demorar um momento para atualizar. Seja paciente ou tente dividir seu texto em seções menores."
          }
        }
      }
    },
    "instagramPostGenerator": {
      "title": "Ferramenta de Gerador de Postagens do Instagram",
      "label": "Gerador de Postagens do Instagram",
      "navDescription": "Crie maquetes realistas de postagens do Instagram de forma rápida e fácil.",
      "subLabel": "Conjunto de Postagens do Instagram",
      "subNavDescription": "Desenhe e personalize maquetes de postagens do Instagram para seus projetos.",
      "description": "Use nossa Ferramenta de Gerador de Postagens do Instagram para criar maquetes personalizáveis de postagens do Instagram.",
      "keywords": {
        "0": "Gerador de Postagens do Instagram",
        "1": "Maquete do Instagram",
        "2": "Modelo de Mídia Social",
        "3": "Criador de Postagens do Instagram",
        "4": "Designer do Instagram",
        "5": "Maquete de Mídia Social",
        "6": "UI do Instagram",
        "7": "Gerador de Postagens",
        "8": "Criador de Conteúdo de Mídia Social"
      },
      "page": {
        "title": "Gerador de Postagens do Instagram",
        "description": "Crie maquetes personalizáveis de postagens do Instagram para seus projetos"
      },
      "userInfo": {
        "username": {
          "label": "Nome de Usuário",
          "placeholder": "Insira o nome de usuário"
        },
        "avatar": {
          "label": "Foto de Perfil",
          "button": "Carregar Avatar"
        },
        "verified": {
          "label": "Conta Verificada"
        },
        "location": {
          "label": "Localização",
          "placeholder": "Insira a localização"
        }
      },
      "postContent": {
        "caption": {
          "label": "Legenda",
          "placeholder": "Escreva a legenda da sua postagem..."
        },
        "timeAgo": {
          "label": "Tempo de Postagem",
          "placeholder": "ex. 2 HORAS ATRÁS"
        },
        "image": {
          "label": "Imagem da Postagem",
          "button": "Carregar Imagem"
        }
      },
      "appearance": {
        "theme": {
          "label": "Tema da Postagem",
          "light": "Claro",
          "dark": "Escuro"
        },
        "viewMode": {
          "label": "Modo de Visualização",
          "web": "Versão Web",
          "mobile": "Versão Mobile"
        }
      },
      "engagement": {
        "likes": {
          "label": "Curtidas",
          "placeholder": "Número de curtidas"
        },
        "liked": {
          "label": "Curtido por você"
        },
        "comments": {
          "label": "Comentários",
          "placeholder": "Número de comentários",
          "label2": "Comentários em Destaque",
          "addPlaceholder": "Adicionar um comentário...",
          "usernamePlaceholder": "Nome de usuário",
          "addButton": "Adicionar",
          "viewAll": "Ver todos os {count} comentários"
        }
      },
      "actions": {
        "download": "Baixar Imagem da Postagem",
        "removeComment": "Remover comentário"
      },
      "postElements": {
        "likes": "{count} curtidas"
      },
      "docs": {
        "title": "📱 Como Usar a Ferramenta de Gerador de Postagens do Instagram",
        "intro": "Crie maquetes personalizáveis de postagens do Instagram com nosso gerador fácil de usar.",
        "usagePolicy": {
          "title": "Política de Uso Importante",
          "intro": "Antes de usar a Ferramenta de Gerador de Postagens do Instagram, leia e entenda as seguintes diretrizes:",
          "disclaimer": "A Rivine Tools não se responsabiliza pelo conteúdo criado usando este gerador. Ao usar esta ferramenta, você concorda em:",
          "rules": {
            "rule1": "Não criar conteúdo que possa prejudicar, assediar, difamar ou intimidar indivíduos ou organizações",
            "rule2": "Não usar imagens geradas para espalhar desinformação que possa impactar negativamente os outros",
            "rule3": "Não apresentar postagens geradas como conteúdo autêntico do Instagram ou postagens reais de contas reais",
            "rule4": "Indicar claramente aos visualizadores que qualquer conteúdo criado com esta ferramenta é gerado e não genuíno",
            "rule5": "Não se passar por indivíduos ou organizações reais com intenção maliciosa",
            "rule6": "Não usar a ferramenta para criar conteúdo que viole quaisquer leis ou políticas de plataforma",
            "rule7": "Usar a ferramenta de forma responsável e ética para fins legítimos, como maquetes, educação ou design"
          },
          "conclusion": "Esta ferramenta é destinada apenas para fins criativos, educacionais e de design. Use-a de forma responsável."
        },
        "whatIs": {
          "title": "✨ O que é a Ferramenta de Gerador de Postagens do Instagram?",
          "description": "O Gerador de Postagens do Instagram é uma ferramenta de design que cria maquetes realistas de postagens do Instagram. É perfeito para criadores de conteúdo, designers, profissionais de marketing ou qualquer pessoa que precise visualizar como o conteúdo pode aparecer no Instagram antes de publicar."
        },
        "features": {
          "title": "📦 Principais Recursos",
          "customization": {
            "title": "Personalização Completa da Postagem",
            "description": "Controle todos os aspectos da sua postagem no Instagram, desde o nome de usuário e foto de perfil até legendas e comentários."
          },
          "themes": {
            "title": "Temas Claro e Escuro",
            "description": "Alterne entre os modos claro e escuro do Instagram para combinar com sua estética preferida."
          },
          "viewModes": {
            "title": "Múltiplos Modos de Visualização",
            "description": "Veja sua postagem em layouts web e mobile para ver como ela apareceria em diferentes dispositivos."
          },
          "download": {
            "title": "Download de Imagem",
            "description": "Baixe sua postagem criada como uma imagem de alta qualidade para uso em apresentações, maquetes ou designs."
          },
          "engagement": {
            "title": "Personalização de Engajamento",
            "description": "Ajuste curtidas e comentários para visualizar diferentes níveis de engajamento no seu conteúdo."
          }
        },
        "steps": {
          "title": "🚀 Como Usar o Gerador de Postagens do Instagram",
          "step1": {
            "title": "Passo 1: Configurar Detalhes do Usuário",
            "description": "Insira um nome de usuário, carregue uma foto de perfil, adicione uma localização e escolha se a conta é verificada."
          },
          "step2": {
            "title": "Passo 2: Adicionar Conteúdo da Postagem",
            "description": "Carregue sua imagem de postagem e escreva uma legenda. Defina o carimbo de data/hora da postagem para indicar quando foi publicada."
          },
          "step3": {
            "title": "Passo 3: Selecionar Opções de Aparência",
            "description": "Escolha entre temas claro e escuro, e selecione o modo de visualização web ou mobile para atender às suas necessidades."
          },
          "step4": {
            "title": "Passo 4: Adicionar Engajamento",
            "description": "Defina o número de curtidas para sua postagem e adicione comentários para tornar sua maquete mais realista."
          },
          "step5": {
            "title": "Passo 5: Gerar e Baixar",
            "description": "Quando estiver satisfeito com seu design, baixe a imagem para uso em seus projetos."
          }
        },
        "customizationOptions": {
          "title": "⚙️ Opções de Personalização",
          "profileSection": {
            "title": "Opções de Perfil",
            "description": "Personalize o perfil do usuário com nome de usuário, foto de perfil, selo de verificação e tag de localização personalizados."
          },
          "contentSection": {
            "title": "Opções de Conteúdo",
            "description": "Carregue sua própria imagem para a postagem e crie uma legenda personalizada para expressar sua mensagem."
          },
          "appearanceSection": {
            "title": "Opções de Aparência",
            "description": "Alterne entre temas claro e escuro, e mude entre modos de visualização web e mobile para diferentes exibições."
          },
          "engagementSection": {
            "title": "Opções de Engajamento",
            "description": "Personalize contagens de curtidas e adicione comentários para simular interação realista do usuário na sua postagem."
          }
        },
        "tips": {
          "title": "💡 Dicas Profissionais",
          "tip1": "Use imagens quadradas (proporção 1:1) para obter os melhores resultados, pois o Instagram exibe postagens nesse formato.",
          "tip2": "Para maquetes mais realistas, use nomes de usuário que reflitam seu p��blico-alvo ou identidade de marca.",
          "tip3": "Ao criar maquetes para clientes, use as cores e estética da marca deles no design da sua postagem.",
          "tip4": "Adicione tags de localização para aumentar a autenticidade da sua maquete, especialmente para conteúdo de viagem ou negócios locais.",
          "tip5": "Use o tema escuro para um visual mais moderno ou para combinar com a estética da sua apresentação."
        },
        "troubleshooting": {
          "title": "🛠️ Está com Problemas?",
          "imageIssues": {
            "title": "Imagem Não Exibindo Corretamente",
            "description": "Tente usar imagens quadradas para exibição ideal. Se as imagens aparecerem esticadas ou comprimidas, ajuste-as para uma proporção de 1:1 antes de carregar."
          },
          "downloadProblems": {
            "title": "Problemas de Download",
            "description": "Se o botão de download não estiver funcionando, tente um navegador diferente ou certifique-se de que você permitiu as permissões necessárias para downloads de imagem."
          },
          "performanceIssues": {
            "title": "Desempenho com Imagens Grandes",
            "description": "Para imagens muito grandes, a ferramenta pode ficar lenta. Tente usar imagens otimizadas com menos de 2MB para obter o melhor desempenho."
          }
        }
      }
    }
  }
}